[
  {
    "title": "Spring AI en action : intégrer les capacités des LLM dans vos applications Java",
    "date": "2026-02-26T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/313356172/",
    "description": "L’IA générative est de plus en plus présente dans nos applications, et plusieurs solutions existent déjà pour l’utiliser. Mais lorsqu’il s’agit d’intégrer un LLM dans une application Java, des questions très concrètes se posent : comment structurer les échanges avec le modèle, lui fournir du contexte métier, ou l’amener à interagir proprement avec vos services ? Spring AI répond à ces enjeux en s’appuyant sur le modèle de programmation Spring.\n\nDans cette session, nous présenterons les concepts essentiels : RAG, Function Calling, Tools, Agents et l’arrivée du MCP, en expliquant clairement leur rôle et en montrant comment ils s’utilisent dans la pratique.\nL’objectif n’est pas de réaliser des implémentations complètes, mais d’illustrer chaque pattern avec des exemples simples afin de mieux comprendre l’intégration des LLM dans une application Java.\n\nNous verrons notamment comment :\n\n* un RAG peut enrichir un modèle avec du contexte issu de vos données\n* le Function Calling permet au LLM d’invoquer des fonctions Java typées\n* certains patterns d’agents permettent de coordonner plusieurs étapes de façon structurée\n* et comment le MCP permet aux modèles d’IA d’interagir avec des outils et des ressources externes de manière structurée\n\nCette session offrira une vue d’ensemble pratique et accessible sur la manière d’intégrer les capacités des LLM dans une application Java en utilisant les mécanismes proposés par Spring AI.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "fr"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Kafka 4, fantastique ?",
    "date": "2026-01-22T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/312859620/",
    "description": "Vous l'attendiez, impatiemment, depuis quatre ans et ... ça y est ! **Kafka 4 est là !** À chaque release majeure, son lot de nouveautés, et on se retrouve pour explorer les évolutions clés, leurs motivations et leurs impacts.\n\nNous aborderons, entre autres :\n\n* **La suppression de ZooKeeper** : le passage à Rraft pour simplifier la gestion et améliorer la scalabilité\n* **Le nouveau protocole de rééquilibrage** : une optimisation des groupes de consommateurs pour plus de stabilité et de performance\n* **Les files d'attente (Early Access)** : une consommation coopérative pour des cas d'usage point-à-point, étendant la polyvalence de Kafka\n\nNous détaillerons également les changements nécessaires pour vos applications (producteurs, consommateurs) et clusters : **migration de Log4j vers Log4j2**, transition de ZooKeeper à KRaft, mise à jour vers Java 11 (clients/Streams) et **Java 17** (brokers/Connect/tools).\n\nVous repartirez avec une compréhension claire des **nouveautés de Kafka 4** et des étapes concrètes pour réussir votre migration, que vous soyez développeur, architecte ou administrateur.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "fr"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Créer un Chatbot Intelligent avec LangChain4j",
    "date": "2025-12-08T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/312127890/",
    "description": "Vous êtes-vous déjà demandé comment ajouter des capacités de chat intelligentes à vos applications Java sans vous noyer dans la complexité de l'IA ? Cette présentation pratique vous guide dans la construction d'un chatbot intelligent, illustrant l'approche conviviale de LangChain4j pour l'intégration d'IA en entreprise.\nCe que vous allez apprendre :\n\n* **Commencer simplement** : intégration de chat WebSocket avec Quarkus\n* **Ajouter de l'intelligence** : intégrer un LLM pour des conversations naturelles\n* **Sécuriser** : modération de contenu avec un modèle d'IA de modération pour gérer les messages inappropriés\n* **Mémoriser le contexte** : mémoire de chat persistante en utilisant d'abord de la mémoire volatile puis Redis pour des conversations multi-sessions\n* **Accéder à la connaissance** : RAG (Retrieval Augmented Generation) avec la base de données vectorielle Qdrant pour des réponses spécifiques à l'entreprise\n* **Connecter le métier** : appel de fonctions pour accéder à l'inventaire en temps réel, aux données utilisateur et à la logique métier\n\nPoints techniques clés :\n\n* **Implémentation réelle** : chatbot e-commerce fonctionnel avec intégration métier réelle\n* **Amélioration progressive** : chaque étape s'appuie naturellement sur la fonctionnalité précédente\n* **Prêt pour la production** : inclut des garde-fous, gestion d'erreurs, gestion de la mémoire et monitoring\n* **IA type-safe** : l'approche basée sur les annotations de LangChain4j élimine le code répétitif\n* **Fonctionnalités d'entreprise** : modération de contenu, mémoire persistante, RAG et appel de fonctions\n* **Parfait pour : les développeurs Java** souhaitant ajouter des capacités d'IA à leurs applications existantes, les architectes concevant des systèmes d'IA conversationnelle, et toute personne curieuse des modèles d'intégration pratiques de l'IA.\n\n**Démo en direct incluse** : découvrez le chatbot complet en action, des réponses en écho basiques au service client intelligent avec récupération de documents et intégration de systèmes métier.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "fr"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Créer un Chatbot Intelligent avec LangChain4j",
    "date": "2025-12-08T19:00:00",
    "url": "https://www.bordeauxjug.org/meetings/20251208-creer_un_chatbot_intelligent_avec_langchain4j",
    "description": "Vous êtes-vous déjà demandé comment ajouter des capacités de chat intelligentes à vos applications Java sans vous noyer dans la complexité de l'IA ? Cette présentation pratique vous guide dans la construction d'un chatbot intelligent, illustrant l'approche conviviale de LangChain4j pour l'intégration d'IA en entreprise. Ce que vous allez apprendre : Commencer simplement : intégration de chat WebSocket avec Quarkus Ajouter de l'intelligence : intégrer un LLM pour des conversations naturelles Sécuriser : modération de contenu avec un modèle d'IA de modération pour gérer les messages inappropriés Mémoriser le contexte : mémoire de chat persistante en utilisant d'abord de la mémoire volatile puis Redis pour des conversations multi-sessions Accéder à la connaissance : RAG (Retrieval Augmented Generation) avec la base de données vectorielle Qdrant pour des réponses spécifiques à l'entreprise Connecter le métier : appel de fonctions pour accéder à l'inventaire en temps réel, aux données utilisateur et à la logique métier Points techniques clés : Implémentation réelle : chatbot e-commerce fonctionnel avec intégration métier réelle Amélioration progressive : chaque étape s'appuie naturellement sur la fonctionnalité précédente Prêt pour la production : inclut des garde-fous, gestion d'erreurs, gestion de la mémoire et monitoring IA type-safe : l'approche basée sur les annotations de LangChain4j élimine le code répétitif Fonctionnalités d'entreprise : modération de contenu, mémoire persistante, RAG et appel de fonctions Parfait pour : les développeurs Java souhaitant ajouter des capacités d'IA à leurs applications existantes, les architectes concevant des systèmes d'IA conversationnelle, et toute personne curieuse des modèles d'intégration pratiques de l'IA. Démo en direct incluse : découvrez le chatbot complet en action, des réponses en écho basiques au service client intelligent avec récupération de documents et intégration de systèmes métier.",
    "community": "bordeauxjug",
    "is_online": false
  },
  {
    "title": "Spring Boot: Chapitre 4",
    "date": "2025-11-20T18:50:00",
    "url": "https://bordeauxjug.org/meetings/20251120-Spring_Boot__Chapitre_4",
    "description": "Spring Boot 4.0 est prévu pour novembre prochain. Même si la baseline reste toujours à Java 17, c’est l’occasion idéale de profiter des nouveautés du langage et du framework.\n\nStéphane commencera par mettre à jour une application existante vers Spring Boot 4.0.\n\nEn chemin, nous verrons comment éviter à l’avenir les NullPointerExceptions en production grâce aux null checks ajoutés dans les projets Spring avec JSpecify.\n\nNous en profiterons aussi pour revoir l’organisation des dépendances : Spring Boot propose désormais des modules plus fins qui offrent davantage de souplesse.\n\nL’intégration de Jackson 3.0 simplifie la configuration et apporte des réglages plus modernes.\n\nEnfin, nous découvrirons comment utiliser un RestClient dans des scénarios asynchrones, sans avoir recours aux types réactifs.",
    "community": "bordeauxjug",
    "is_online": false
  },
  {
    "title": "Karate Connect : votre partenaire de combat dans l’arène des tests API",
    "date": "2025-10-16T19:00:00",
    "url": "https://www.meetup.com/bordeauxjug/events/311318217/",
    "description": "Je travaille sur une data pipeline basée initialement sur Kafka Stream et Snowflake. Les tests d’intégration utilisent l’outil Open Source [Kapoeira](https://github.com/lectra-tech/kapoeira). Mais récemment, la pipeline a évolué pour intégrer DBT et se connecter à RabbitMQ et PostgreSQL.\n\nMais comment tester toutes ces API, utilisant plusieurs protocoles (HTTP, AMQP, Kafka, JDBC) ? Vous connaissez sans doute l’outil Open Source [Karate](https://github.com/karatelabs/karate) pour tester vos API HTTP. Il propose des extensions (RabbitMQ, Kafka, …), pas toujours simples à utiliser ou en mode Closed Source sous licence payante.\n\nJe vous propose le partenaire idéal pour relever ce challenge : [Karate Connect](https://github.com/lectra-tech/karate-connect), Open Source, utilisant Karate Core et gérant nativement plusieurs protocoles via ses extensions.\n\nÊtes-vous prêt à combattre dans l’arène des tests API ?",
    "community": "bordeauxjug",
    "is_online": false
  },
  {
    "title": "Les super pouvoirs du package java.util.function",
    "date": "2025-06-12T19:00:00",
    "url": "https://www.bordeauxjug.org/",
    "description": "Le package `java.util.function` fêtera ses 11 ans en 2025 et force est de constater que malgré son omniprésence dans nos développements, son utilisation reste probablement sous-estimé et mal comprise.\n\nAvez-vous déjà utilisé ces classes comme paramètre de vos méthodes ? Avez-vous déjà utilisé leur capacité de composition ? Ne vous êtes vous jamais dit que cet héritage douteux entre deux classes, ne vous plait pas, mais que faute de mieux, il reste là ?\n\nSans pour autant abuser des concepts de programmation fonctionnelle, nous aimerions vous présenter pendant ce talk à travers de cas concrets, une utilisation plus avancée du package [java.util.function.](http://java.util.function./)\nFonctions anonymes, d’ordre supérieur ou encore la composition de fonctions, toutes ces notions n’auront désormais plus de secret pour vous et trouveront une place de choix dans votre boîte à outils de refactoring.\n\nVous repartirez avec un dépôt git avant/après en prime !\n\nPlus d'information sur le site du JUG : http://bordeauxjug.org/meetings/20260612-les_super_pouvoirs_du_package_java.util.function",
    "community": "bordeauxjug",
    "is_online": false
  },
  {
    "title": "Elasticsearch Query Language: ES|QL",
    "date": "2025-03-20T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/306640938/",
    "description": "Elasticsearch et Kibana apportent un tout nouveau langage, **ES\\|QL**, avec une **nouvelle API (\\`_query\\`)** et une **syntaxe simplifiée.**\nCela vous permet d'affiner vos résultats, étape par étape et ajouter de nouvelles fonctionnalités comme par exemple l'enrichissement de données et la transformation à la volée, directement dans votre requête.\nEt vous pouvez l'utiliser sur **toute la plateforme Elastic** — depuis les API Elasticsearch jusqu'aux fonctions de **\"Discover\" et d'\"Alerting\"** de Kibana.\nMais le changement principal n'est pas celui que vous verrez : les ingénieurs ont développé un **tout nouveau moteur de calcul**, construit avec la performance comme guide.\nVenez découvrir un aperçu de ce **nouveau moteur avec découverte** de la syntaxe et du fonctionnement interne.\nPlus d'informations sur notre site : http://bordeauxjug.org/meetings/20250320-elasticsearch_query_language:_es_ql",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Assemblée Générales 2025",
    "date": "2025-03-13T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/306640736/",
    "description": "Les soirées du BordeauxJUG sont organisées par des bénévoles. **L'association a besoin de volontaire comme vous pour poursuivre ces activités**\nCe sera l'occasion pour l'équipe de faire une rétrospective sur l'année passée ainsi que d'élire un nouveau bureau.Nous rappelons que **l'AG est ouverte à tous**. Par contre, seules les personnes ayant fait un don ou ayant souscrit au BordeauxJUG cette année pourront prendre part aux votes, et notamment à l'élection du futur bureau.\n**N'hésitez donc pas à verser votre obole**\nVérifier que vous êtes à jour au niveau des cotisations sur la page [Membres](http://bordeauxjug.org/members) avant l'AG pour pouvoir voter !Le lieu exacte de l'assemblée est le 1er étage à coté des salles de TD\nPlus d'informations sur http://bordeauxjug.org/meetings/20250313-assemble_generale_2025",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Tabby & Continue.dev : la dream team pour un IA coding assistant",
    "date": "2025-02-13T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/306028825/",
    "description": "La rapide évolution de l’IA dans le développement logiciel a donné naissance à des outils puissants tels que GitHub Copilot. Pourtant, la nécessité d’une connexion internet permanente, le contrôle limité sur les modèles sous-jacents, les coûts associés et les préoccupations liées à la confidentialité des données poussent à la recherche d’une solution plus flexible : Tabby ML.\n**Tabby offre une expérience comparable à Copilot, mais se démarque par son approche 100% gratuite et open-source**, vous offrant une autonomie totale. D’un simple clic, vous pouvez déployer votre propre instance Tabby — localement ou sur vos propres serveurs — rendant le codage assisté par IA possible même en avion ou en train. Grâce à l’extension Tabby pour VSCode, IntelliJ et plus encore, vous pouvez coder en toute confiance n’importe où, n’importe quand.\nAu-delà du client officiel de Tabby, il existe également **Continue.dev, un autre plugin open-source qui se connecte facilement au serveur Tabby**. Il exploite toutes les capacités de Tabby tout en apportant ses propres avantages en termes d’expérience utilisateur, offrant ainsi un workflow fluide et personnalisable.\nDans cette présentation, nous explorerons les fonctionnalités de **Tabby, son architecture et la manière dont il redéfinit la génération de code pilotée par IA**. Nous verrons également comment ces options côté client — le client natif de Tabby et Continue.dev — renforcent votre liberté et votre confidentialité, tout en libérant votre potentiel créatif en matière de codage. Rejoignez-nous pour découvrir comment Tabby peut vous permettre de coder sans limites.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Optimisation des images Docker Java avec Jdeps, Jlink et les layers Docker",
    "date": "2025-01-16T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/305522695/",
    "description": "Dans un contexte d'application web Java Dockerisée, le poids de l'application peut vite devenir un problème... Surtout dans une application en micro-services : les images Docker se multiplient, l'espace disque sur les machines et l'espace alloué sur le dépôt Docker deviennent tous les deux des sujets critiques.\nL'objectif est dans un premier temps de découvrir les outils comme Jlink et Jdeps, permettant d'alléger les images Docker Java. Ensuite, nous étudierons plus en détails le fonctionnement de Docker et ses layers, permettant de profiter de la réutilisation de fichiers d'une image à l'autre.\nCes deux axes constituent des bonnes pratiques réutilisables sur toutes les applications Docker, qu'elles soient des applications en microservices ou non, Java ou non.\nJe ne prétends pas être expert Docker, les points présentés viennent en premier lieu des expériences acquises sur le projet sur lequel je travaille. L'optimisation d'images est un sujet assez vaste, pouvant aller très loin, d'autres pistes comme le Garbage Collector (celui de Docker) et les bonnes pratiques d'écriture de DockerFile multistage pourraient être explorées.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Picocli : mets du Java dans ton terminal ! ",
    "date": "2024-12-12T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/304849722/",
    "description": "Les **CLI** (Command Line Interface), tout le monde les utilise et elles existent depuis la nuit des temps. Souvent synonymes de gain de productivité, leur création est parfois obscure et peut sembler complexe. C'était le cas il y a quelques décennies, mais depuis quelques années, des langages et Frameworks permettent d'en écrire simplement dans votre langage préféré. Je vous propose d'utiliser un langage qui ne paraît pas, au premier abord, le plus intuitif pour faire une CLI : Java !\nMais il sera bien accompagné dans cette tâche : grâce à **Picocli** et **Quarkus**, notre CLI aura tout d'une grande, tout en étant simple à développer ! Et cerise sur le gâteau : nous créerons un “vrai” exécutable grâce à **Graal VM.**\nVenez m'accompagner lors d'une **session de live coding** permettant de mettre en lumière comment **créer une CLI en Java** avec Picocli et Quarkus en partant de zéro !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "IA générative en action: Intégrez les LLM dans vos applications",
    "date": "2024-11-14T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/304423651/",
    "description": "**L'IA générative** et les grands modèles de langage (LLM) sont des sujets en vogue **depuis l'apparition de ChatGPT fin 2022**. Aujourd'hui au-delà de la hype et des polémiques,\nQuel est l'état de l'art sur le plan technique ?\nQuels sont les concepts et pratiques clés pour tirer parti de la puissance des LLM dans nos applications ?",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Quarkus : Greener, Better, Faster, stronger.",
    "date": "2024-10-10T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/303769488/",
    "description": "**Quarkus** n'est maintenant plus un nouveau venu dans l'écosystème java, et de plus en plus de projets l'adoptent comme base de travail, mais peu de développeurs comprennent vraiment à quel point la magie se cache dans ses extensions.\nC'est en développant l'extension **Quarkus Min.io** que j'ai découvert une partie de leurs capacités, et comment elles sont en fait au coeur des promesses du framework. Leur développement est simple et permet de rendre un grand nombre de services à nos utilisateurs. Mais surtout elles permettent de ne rendre que les services dont l'utilisateur à besoin nous permettant d'économiser mémoire, cpu et de raccourcir les temps de démarrage.\nEt si vous veniez en développer une avec moi et que nous mettions en oeuvre quelques uns de ces tours de magie ?\nVous pourriez peut être aussi aimer ça et repartir avec quelques idées !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Design First : OpenApi et AsyncApi en action !",
    "date": "2024-09-26T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/303373620/",
    "description": "Aujourd'hui en terme d'API nous notons deux grandes familles, les **API Synchrones** (de type REST par exemple) et **Asynchrone** (Messaging, Topic).\nAfin d'uniformiser et de spécifier des contrats d'interface clair, deux spécifications ont peu à peu emmergées : **OpenApi** d'un côté pour les API REST et **AsyncApi** dans le cadre des architecture évenmentielles **(EDA).**\nNous allons voir au travers de ce talk et de démos ce qu'apportent ces deux spécifications en terme de design, de documentation mais également en terme de génération de code.\nCe principe appelé **Design First** consiste à Définir son API (REST ou Asynchrone) en amont et de bénéficier d'outils divers et variés pour manipuler ces contrats.\nJe ne prétends pas détenir la vérité absolue, ce sont plutôt mes réflexions au grès de mes expériences autour des APIs REST puis désormais Asynchrones que j'essaye de promouvoir auprès de clients et développeurs.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "JUG Off 2024",
    "date": "2024-07-18T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/302240218/",
    "description": "Le mois de Juillet est là et cela sent bon les vacances.\nC'est l'occasion pour se retrouver autour d'une table pour discuter du monde JAVA, de la JVM ou d'autres sujets amenés par les participants.\nCette année, nous reprenons les basiques avec un restaurant italien\nCela sera aussi l'opportunité de retrouver l'équipe et de faire un point sur le BordeauxJUG donc n'hésitez pas à venir.\nAttention afin de pouvoir réserver, la limite des inscriptions est fixée au 17 juillet à 14h.\nA fin de réserver le nombre correcte, Merci de vous inscrire si vous êtes sûr de venir et de décommander si vous avez un empêchement.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "Alcala",
      "address": "Place Alcala de Henares, 33400",
      "city": "Talence",
      "country": "France"
    },
    "location": "Place Alcala de Henares, 33400, Talence"
  },
  {
    "title": "Java 22+",
    "date": "2024-06-19T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/301614999/",
    "description": "Java 21 est sortie en Septembre dernier et déjà les features de la prochaine LTS arrivent incrémentalement dans Java 22 et 23.\nJe vous propose un tour des **nouvelles features au niveau du langage**, les classes implicites, le pattern any (utilisant l'underscore) ou les constructeurs flexibles et coté API, **les Gatherers**, qui rendent les streams plus expressifs et **la Foreign Memory API** qui permet de gérer plus finement la mémoire et se débarrasser enfin de sun.misc.Unsafe. Donc au programme, un peu de slides pour les concepts, et pas mal de live coding pour expérimenter le futur de Java.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Wargames - Java vulnerabilities and why you should care",
    "date": "2024-06-06T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/301350591/",
    "description": "**Java is great** and we all spend time on making it more performant, more scalable and maintainable.\nBut we better should also spend some time on making it more secure.\nWith all that new Java releases and features also come **new vulnerabilities and exploits**. Because Java is everywhere, it has a huge attack surface which makes it interesting for hackers to search for vulnerabilities in Java and foremost in Java based applications.\nI'm not a Java security specialist and if you are like me wonder what all these mystique acronyms like NVD, CVE, CVSS, CPU, PSU etc. **mean and how they are related to Java security,** come to this session and I will explain it to you. It will also be shown what tools are available to you to check whether your Java application is vulnerable to known issues",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Comment être un développeur à 360° en 2024",
    "date": "2024-05-23T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/300982636/",
    "description": "Un changement discret des mutations qui affectent notre industrie avec l’adotion généralisée de la CI/CD, du cloud, de Kubernetes, du devops et autres tendances est que le développement n’est plus une action isolée et intégrée mais prend part à un écoystème complet.\nC’est pour celà que les développeurs ne peuvent plus ignorer ce qui les entoure en 2024 et doivent ajuster leur travail en fonction de ces facteurs.\nCette conférence parle de ce changement radical et l’illustrera avec un retour d’expérience qu’on a eu à Yupiik sur un travail de plus d’un an chez un client.\nDurant cette période on a construit de zéro une ferme de développement, l’infrastructure mais aussi les solutions de documentation et de tests de la presque centaine d’applications livrées dans la période.\nLa première partie de la conférence expose les challenges et solutions pour construire une ferme de développement moderne avec des outils OSS on premise (en utilisant Kubernetes, Gitea et Drone comme alternative à Github Enterprise), la seconde partie se focalise sur le développement et comment Kubernetes simplifie énormément ce que l’on met dans les applications pour des livraisons plus rapides et des évolutions plus simples, enfin, la dernière partie montre comment s’appuyer sur une tel infrastructure pour servir des solutions plus avancée et notamment comment construire une solution de benchmarking distribuée avec Gatling OSS tout en gardant un reporting simple ou encore gérer ses audits de sécurité (dépendances, images, …​) à jour avec un simple site statique \"au build\".\nCette conférence a pour but de vous faire changer d’avis sur l’état d’esprit à avoir pour être un bon développeur en 2024 et arrêter de focaliser sur des frameworks mais avoir vraiment une vision à 360° du travail.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Builds Reproductibles avec Apache Maven",
    "date": "2024-04-04T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/299990747/",
    "description": "Les Builds Reproductibles sont préconisés pour le niveau 4 de SLSA, pour atteindre le plus haut niveau de confiance sur un logiciel. Un tel niveau semble totalement inaccessible pour un projet normal.\nEn réalité, la plupart des distributions Linux ont implémenté les Builds Reproductibles ces 10 dernières années. Et depuis 5 ans, cela a été appliqué à de nombreux projets Open Source Java avec succès : plus de 2000 releases vérifiées reproductibles ont été publiées sur Maven Central par 500 projets, et ces chiffres ne cessent de croître.\nDans cette session, nous démystifierons les pratiques pour les Builds Reproductibles telles qu'elles ont été éprouvées et améliorées sur le terrain. Nous expliquerons les outils utiles pour améliorer vos builds Maven et vérifier qu'ils sont réellement reproductibles : vous verrez, ce travail est riche d'enseignements utiles bien au delà de la sécurité.\nAttention: si vous dormez pendant la session, vous aurez une sale note au quizz final permettant de vérifier les compétences acquises...",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Le versioning des APIs REST: dans la vraie vie on fait comment?",
    "date": "2024-03-21T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/299719481/",
    "description": "Quand on souhaite publier des APIs avec par exemple, une solution d’ API Management, on évoque régulièrement le versioning. Cette pratique répond à des contraintes projet mais apporte malheureusement son lot de complexité.\nImaginez, vous travaillez sur un produit qui expose des APIs à plusieurs clients. Vous devez leur proposer des évolutions et nouvelles fonctionnalités tout en maîtrisant l’existant. Quelle stratégie adopter? Quelles solutions techniques peut-on mettre en place simplement ?\nDans cette présentation, vous (re)découvrirez des conseils que j’ai pu mettre en pratique et qui m’ont aidé lors de mes derniers projets.\nNous aborderons, au travers d’un cas concret, la stratégie à mettre en œuvre, les différentes possibilités d’implémentation ainsi que leurs contraintes.\nA l’issue de cette présentation, nous aurons une vue complète et objective des manières d’appréhender le versioning d’APIs.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Assemblée Générales 2024",
    "date": "2024-03-11T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/299601637/",
    "description": "Les soirées du BordeauxJUG sont organisées par des bénévoles. **L'association a besoin de volontaire comme vous pour poursuivre ces activités**Ce sera l'occasion pour l'équipe de faire une rétrospective sur l'année passée ainsi que d'élire un nouveau bureau.Nous rappelons que **l'AG est ouverte à tous**. Par contre, seules les personnes ayant fait un don ou ayant souscrit au BordeauxJUG cette année pourront prendre part aux votes, et notamment à l'élection du futur bureau.**N'hésitez donc pas à verser votre obole**Vérifier que vous êtes à jour au niveau des cotisations sur la page [Membres](http://bordeauxjug.org/members) avant l'AG pour pouvoir voter !\nLe lieu exacte de l'assemblée est le 1er étage à coté des salles de TD",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Découvrir le Property Based Testing : De la Théorie à la Pratique avec jqwik",
    "date": "2024-02-15T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/298948411/",
    "description": "Le **Property Based Testing** est une méthode de test logiciel où les tests vérifient les propriétés générales d'une fonction plutôt que des cas spécifiques. Cette approche génère automatiquement de multiples entrées de test pour couvrir une large gamme de scénarios, au lieu de se reposer sur des exemples fixes. Elle met en évidence les bugs subtils en réduisant les cas d'échec complexes à leurs formes les plus simples, facilitant ainsi le débogage.\nDans cette présentation, nous aborderons les bases du PBT et examinerons ses patterns essentiels, tels que le Round-tripping, la Commutativité, l'Invariance et l'Idempotence. Nous mettrons en lumière les bénéfices d'utiliser un framework de PBT efficace, en comparaison avec les méthodes de tests unitaires traditionnels. Nous conclurons par une démonstration pratique via l'utilisation de la librairie **jqwik**, illustrant l'application concrète du PBT.\nCette session vise à offrir une compréhension approfondie du PBT et de son potentiel dans l'amélioration des processus de test. Elle permettra également de découvrir comment un framework de PBT peut transformer l'approche de test dans les projets de développement. Enfin, le cas pratique avec **jqwik** servira d'exemple tangible pour mettre en application les concepts théoriques discutés.!",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Generative IA par la pratique : cas concrets  d'un LLM en Java, LangChain4J",
    "date": "2024-01-18T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/298313430/",
    "description": "Les **Large Language Models (LLM)** sont une nouvelle technologie puissante qui peut être utilisée pour une variété de tâches, notamment la génération de texte, la traduction de texte et la rédaction de différents types de contenu créatif. Cependant, les LLMs peuvent être difficiles à utiliser, en particulier pour les développeurs qui ne sont pas expérimentés en Python, la “lingua franca” de l'IA.\nAlors, qu'en est-il des développeurs Java ? Comment pouvons-nous tirer parti de l'IA générative ?\nCette présentation vous montrera **comment utiliser les LLMs en Java** sans avoir besoin de Python. Nous utiliserons l'API PaLM et Gemini, fournie par les services Google Cloud Vertex AI, pour effectuer une variété de tâches, telles que la recherche dans de la documentation, la génération d'histoires pour enfants, la synthèse du contenu, l'extraction de mots-clés ou d'entités, et plus encore.\nEt nous plongerons dans les possibilités offertes par le **framework LangChain4J** pour les développeurs Java !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Les promesses de Loom ... Soyez au rendez-vous !",
    "date": "2023-11-23T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/297384459/",
    "description": "#### **Sujet n°1 - Les promesses de Loom ... Soyez au rendez-vous !**\nLe projet **Loom** fait parler de lui depuis plusieurs mois. Il marque une avancée technique majeure de la plateforme Java en améliorant le système de concurrence à travers 3 nouvelles fonctionnalités : Virtual Threads (JEP 444), Structured Concurrency (JEP 453) et ScopedValue (JEP 448).\nAvec la sortie récente de **Java 21** LTS, les **Virtuals Threads sont « production-ready »**. En tant que développeur Java, cette perspective n’est pas sans poser de questions :\n* Les promesses d’amélioration techniques seront-elles (toujours) au rendez-vous ?* Comment l’écosystème va-t-il s’adapter ? Quels impacts sur les frameworks ?* Faudra-t-il modifier le code métier ? La programmation asynchrone va-t-elle devenir obsolète ?* Quels moyens de monitoring et d’observabilité ?* Quels impacts pour le déploiement en container (configuration des JVM et scaling )?\nA travers cette présentation, nous prendrons le point de vue développeur et architecte Java pour faire un tour d’horizon complet. Nous vous partagerons nos résultats de benchmarks ainsi que des exemples de code. Bref, nous verrons comment préparer concrètement l’arrivée de Loom dans nos projets Java !\n#### **Sujet n°2 - Loom : de l'observabilité du virtuel à une réelle adoption et mise en production**\nEn poussant les limites runtime de Java à son extrême, **Loom** nécessite une **observabilité adaptée** :\n* quels sont les moyens disponibles à ce jour ?* Quoi mesurer et comment ?\nPassons en revue l'état de l'art dans le domaine sur **Java 21** et couvrons quels cas de figure illustrés par des rapports d'analyse réalisés avec Jeyzer.\nSur la base de ces points, discutons enfin d'une adoption pragmatique des threads virtuels au sein de projets, en vue d'une mise en production. Rejoignez-nous pour cette passionnante session d'exploration qui nous éclairera sur cette virtualité si attendue et devenue bien réelle avec **Java 21**.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "La recherche à l'ère de l'IA",
    "date": "2023-10-26T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/296632690/",
    "description": "La recherche ne se contente plus de l'approche maintenant traditionnelle basée sur la fréquence des termes (TF/IDF ou BM25) mais plus sur la tendance actuelle du machine learning où les nouveaux modèles ont ouvert une nouvelle dimension pour la recherche.\nCette conférence donne un aperçu de :\n* La recherche \"Classique\" et ses limitations* Qu'est qu'un modèle de machine learning et comment vous pouvez l'utiliser* Comment utiliser la recherche vectorielle ou la recherche hybride dans Elasticsearch* Comment ChatGPT d'OpenAI ou les \"large language models\" (LLMs) similaires viennent jouer naturellement avec Elastic",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "JUG Off 2023",
    "date": "2023-07-06T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/294526561/",
    "description": "Le mois de Juillet est là et cela sent bon les vacances.\nC'est l'occasion pour se retrouver autour d'une table pour discuter du monde JAVA, de la JVM ou d'autres sujets amenés par les participants.\nCette année, nous changeons de style, nous partons au japon, pays du Sushi, Maki et autres.\nCela sera aussi l'opportunité de retrouver l'équipe et de faire un point sur le BordeauxJUG donc n'hésitez pas à venir.\nAttention afin de pouvoir réserver, la limite des inscriptions est fixée au 05 juillet à 14h.\nA fin de réserver le nombre correcte, Merci de vous inscrire si vous êtes sûr de venir et de décommander si vous avez un empêchement.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "Yamato",
      "address": "20 All. du 7ème art",
      "city": "Talence",
      "country": "France"
    },
    "location": "20 All. du 7ème art, Talence"
  },
  {
    "title": "Laptop as Code",
    "date": "2023-06-08T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/293890281/",
    "description": "Un nouveau développeur rejoint votre équipe. Combien de temps faut-il pour configurer son ordinateur? Votre disque dur est cassé. Combien de temps pour tout réinstaller sur un nouveau disque?\nL'idée de ce talk est de partager le concept d'un ordinateur stateless.Toute configuration est versionnée sous Git et Ansible devient votre meilleur ami.\nAu programme : présentation de Ansible, ansible-pull, ansible-galaxy, démo de réinstallation du poste en quelques minutes seulement..",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Fluid Pull Request",
    "date": "2023-04-27T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/292991518/",
    "description": "Les Pull Requests sont aujourd'hui la colonne vertébrale de toute infrastructure DevOps. Mais ce succès a sa part d'ombre: elles sont aussi devenues le principal goulot d'étranglement du cycle de développement avec un impact significatif sur le 'Lead Time for Changes'. Au cœur des frictions, des frustrations et des ralentissements, l'étape manuelle de revue de code qui a peu évolué depuis 2008.\n'Fluid Pull Requests' est un concept émergent pour accélérer, sécuriser et automatiser cette étape de revue de code et d'approbation. En fonction de l'évaluation du niveau de sensibilité des changements, il est possible d'introduire beaucoup plus de flexibilité comme par exemple avec les revues de code asynchrones. Cette étape est d'autant plus importante que demain le code sera généré tout autant par des humains que par des bots autonomes.\nPlus d'informations sur [http://www.bordeauxjug.org](le site du BordeauxJUG)",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "CRaC vs GraalVM, pour un démarrage rapide",
    "date": "2023-04-06T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/292473540/",
    "description": "Dans les cas d'usages modernes (Kubernetes, Serverless), tout le monde sait que le point noir de la JVM est son démarrage.\nDepuis quelques années, GraalVM s'impose comme rémède permettant ainsi un démarrage rapide via une compilation native. Cela apporte néanmoins certaines contraintes.\nUne nouvelle solution apparait dans le paysage de la JVM. C'est **CRaC** pour **Coordinated Restore at Checkpoint.** Regardons ensemble comment cela fonctionne et les avantages.\nPlus d'informations sur le [site de votre JUG](http://www.bordeauxjug.org/)",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "AG 2023",
    "date": "2023-03-13T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/292117139/",
    "description": "Les soirées du BordeauxJUG sont organisées par des bénévoles. **L'association a besoin de volontaire comme vous pour poursuivre ces activités**Ce sera l'occasion pour l'équipe de faire une rétrospective sur l'année passée ainsi que d'élire un nouveau bureau.Nous rappelons que **l'AG est ouverte à tous**. Par contre, seules les personnes ayant fait un don ou ayant souscrit au BordeauxJUG cette année pourront prendre part aux votes, et notamment à l'élection du futur bureau.**N'hésitez donc pas à verser votre obole**Vérifier que vous êtes à jour au niveau des cotisations sur la page [Membres](http://www.bordeauxjug.org/members) avant l'AG pour pouvoir voter !\nLe lieu exacte de l'assemblée est le 1er étage à coté des salles de TD",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "JOOQ, joy of SQL",
    "date": "2023-02-23T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/291725364/",
    "description": "Et si l'on reprenait le contrôle de nos interactions avec notre base de données préférée? Car en vrai, nos BDD sont des monstres de puissance qui sont souvent sous exploitées 😓.\nNous verrons, avec JOOQ comment écrire des requêtes SQL simples ou évoluées, le tout facilement et de manière type-safe !\nVenez découvrir cette superbe librairie OpenSource, compatible Java, Kotlin & Scala, qui va vous permettre de vous simplifier la vie et d'améliorer votre code... et même de découvrir de super fonctionnalités SQL que vous n'imaginiez même pas..",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "400 API et 2000 types : genèse du nouveau client Java pour Elasticsearch",
    "date": "2022-12-15T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/290213190/",
    "description": "Un nouveau client Java pour Elasticsearch est sorti fin 2021. Plus léger, plus rapide, plus ergonomique et... généré à 99% !\nL'API d'Elasticsearch a grandi de façon organique depuis 10 ans et compte près de 400 points d'API et 2000 structures de données. Jusqu'à 2021 il n'y avait pas de spécification formelle complète de cette API. Gênant pour générer du code... On a rapidement vu que OpenAPI était difficilement applicable, et pris une approche originale, en modélisant l'API avec des types TypeScript \"compilés\" dans un modèle servant de base à la génération de code.\nComment ensuite, à l'usage, s'y retrouver dans cette API très riche ? On verra avec quelques exemples que l'utilisation de fluent functional builders et de tagged unions (un peu de formalisme pour des choses simples) permet une écriture proche d'un DSL où on se laisse guider par l'autocomplétion de l'IDE sans jamais avoir à taper un nom de classe, dans des structures arborescentes et polymorphiques proposant parfois plus de 50 variantes.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Micronaut Test Resources",
    "date": "2022-10-18T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/289013582/",
    "description": "Tester vos microservices sans peine avec **Micronaut Test Resources** Micronaut est un framework full-stack moderne, **basé sur la JVM**, permettant de construire des microservices ou applications serverless facilement.\nDe part son emphase sur la compilation ahead-of-time, il s'intègre particulièrement bien avec **GraalVM**, poussant les limites de ce qu'on peut faire avec le langage Java.\nCependant, le développement d'applications modernes est aussi synonyme de multiples intégrations qui sont parfois difficiles à configurer. Par exemple, votre application peut avoir besoin d'une base de données, d'un serveur Kafka, d'un broker MQTT ou autre. **Micronaut Test Resources** permet de grandement simplifier le développement de telles applications: sans aucune configuration, il est capable de démarrer des conteneurs de test pendant le développement ou les tests, réduisant considérablement l'effort nécessaire pour obtenir une excellente productivité développeur.Dans cette session, nous montrerons les bases d'une application **Micronaut** et comment il s'intègre, en partculier, avec les outils de builds et **Testcontainers**.\n**Micronaut Test Resources** est aussi un framework extensible, rendant relativement simple l'ajout de vos propres ressources de test: il est par exemple possible d'exposer un conteneur Docker avec quelques lignes de configuration. En dernier recours, il est toujours possible d'implémenter vos propres ressources de test.\nEnfin, il est intéressant de savoir que **Micronaut Test Resources** est conçu de façon à ce que les ressources de test puissent être partagées entre différents projets, même s'ils utilisent des outils de build différent ! Cerise sur le gâteau, nous montrerons comment les images natives peuvent bénéficier de ce mécanisme.\nPlus d'informations sur http://www.bordeauxjug.org",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Programmation Asynchrone avec Loom",
    "date": "2022-09-22T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/288362719/",
    "description": "En travaux depuis de nombreuses années, le projet Loom a pour objet d'apporter un nouveau modèle de programmation asynchrone dans le JDK.\nDisponible en préversion dans le **JDK 19**, on peut donc commencer à l'expérimenter, et comprendre les patterns de code que ce projet apporte. **Loom** arrive en deux parties.\n* La première comprend les **threads virtuels,** que l'on peut créer en très grand nombre, et que l'on peut bloquer sans que cela coûte cher. Nos bons vieux threads (25 ans) font de la place à ce nouveaux type de threads.\n* La seconde est un nouveau **modèle de programmation asynchrone**: la programmation concurrente structurée, construite sur la notion de scope. Nous couvrirons ces deux sujets.\nPeu de slides dans cette présentation, beaucoup de code afin de comprendre la façon dont **Loom** va révolutionner l'écriture de code asynchrone",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Quarkus World Tour 2022 s'arrête au BordeauxJUG",
    "date": "2022-06-09T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/286319172/",
    "description": "Cette année encore, l'équipe **Quarkus** fait une étape à Bordeaux à l'occasion du **Quarkus World Tour 2022 !**\nCet événement nous sera présenté par Gwenneg Lepage, Senior Software Engineer chez Red Hat, contributeur Quarkus et passionné d'aviation.\nLors d'une session très orientée **live coding**, il nous montrera comment construire \"from scratch\" une application Quarkus distribuée de suivi des vols en temps réel. De Kafka aux websockets en passant par **RESTEasy Reactive** et **Hibernate Reactive**, nous ferons un tour d'ensemble de nombreuses extensions Quarkus. Le live coding se conclura par un déploiement de l'application sur Red Hat **OpenShift.**La démo sera précédée d'une introduction à **Quarkus** et suivie d'une séance de questions.\nVous ne connaissez pas Kafka, la programmation réactive ou le système de surveillance ADS-B ? Pas de panique, cette session restera accessible aux débutants. Alors venez nombreux !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Workshop Kafka Streams 101",
    "date": "2022-05-28T10:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/285941366/",
    "description": "[Apache Kafka](https://kafka.apache.org/) est aujourd'hui l'une des plateformes de messaging les plus populaires pour gérer les flux de données en temps réel. Beaucoup d'entreprises l'utilisent comme pilier dans une architecture microservice évenementielle ou pour construire leur plateforme de streaming. [Kafka Streams](https://kafka.apache.org/documentation/streams/) est la bibliothèque ultra-lègere permettant de manipuler, transformer, filter, enrichir,....les données au sein d'un cluster Apache Kafka et cela en s'abstrayant complétement du code de plomberie.\nRien de mieux qu'une petite mise en situation pour comprendre les concepts derrière Kafka Streams. Imaginez, vous travaillez pour une grande institution bancaire, The Bank Corp! Le salaire et les jours de congés vous ont fait accepter ce poste mais c'était sans compter le travail. Au sein de cette dernière, votre équipe business souhaiterait mettre en place des traitements en temps réel des transactions que vos clients réalisent. Ils souhaitent être en capacité de détecter des transactions financières particulièrement élevées, des potentielles fraudes mais également de pouvoir connaître le solde des comptes et tout cela en temps réel!\nDurant ce workshop, vous allez mettre en place la libraire Kafka Streams afin de répondre aux besoins de l'équipe métier. Vous découvrirez les principaux concepts derrière Apache Kafka. Qu'est-ce qu'un topic, une partition, les offsets, la compaction, le co-partitioning ? Toutes ces notions que vous avez peut-être déjà entendu sans trop comprendre de quoi il en retourne. Vous découvrirez également les caractéristiques d'une application Kafka Streams comme les notions de KStream, KTable, la sémantique exactly-once, en quoi ces applications sont résilientes, scalables, etc...Ce workshop s'adresse aussi bien aux personnes ne connaissant pas le monde Kafka et aux personnes ayant déjà des notions souhaitant découvrir Kafka Streams.\n**PRÉ-REQUIS :**\n* JDK 11+* Maven* Git* Docker / Docker Compose* Votre IDE préféré* Cloner ce répertoire github : https://github.com/vgallet/workshop-kafka-streams* Lancer un docker-compose up à la racine afin de télécharger les images docker* Faire un mvn clean compile afin de récupérer les dépendances",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Architecture microservices & cohérence des données : mais comment pour de vrai ?",
    "date": "2022-05-12T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/285680552/",
    "description": "Les architectures microservices ont le vent en poupe. Elles présentent de nombreux avantages pour mettre en place les bonnes pratiques DevOps et faire travailler en parallèle des équipes pluridisciplinaires autonomes.\nEvoluer du monolithe vers les microservices n'est pas un long fleuve tranquille... Les challenges ne manquent pas. L'un d'entre eux, et non des moindres, est la cohérence des données. Un des principes est que chaque service possède sa propre base de données. Quand une transaction métier invoque plusieurs services, on ne peut donc plus compter sur les bonnes vieilles transactions ACID locales. Quant aux transactions distribuées XA/2PC, elles sont jetées au pilori des mauvaises pratiques depuis bien longtemps !\nUne fois ce constat établi, on fait quoi concrètement ? Comment peut-on répondre à cette problématique ?\nDans cette présentation, nous verrons comment procéder avec deux approches : les SAGA et les LRA (Long Running Action). Un exemple concret basé sur MicroProfile et le framework Eventuate Tram vous permettra de les appréhender et de choisir la bonne option pour votre prochain projet microservices",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Développer un opérateur Kubernetes en Java, c'est possible !",
    "date": "2022-04-07T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/284935523/",
    "description": "Il n'est plus, je pense, nécessaire de présenter Kubernetes tellement il fait parti du paysage informatique. Avec sa généralisation, de nouveaux types de développements et de patterns sont apparus. Lors de ce talk j'aborderai l'un d'eux : les opérateurs.\nMerveilleux assistants, aptes à faire énormément de choses. Mais voilà, les nombreuses documentations que l'on trouve tournent principalement autour d'un langage : Go. Ce n'est pas que cela ne me plaise pas, mais l'idée est de pouvoir aussi le faire avec un autre langage que je connais et utilisé par de nombreuses équipes de développement : Java.\nLors de ce talk, je vous présenterai, de manière simple, la notion des opérateurs au sein de Kubernetes : à quoi ils servent et comment ils évoluent dans l'éco-système Kubernetes. Nous verrons qu'ils peuvent être de simples aides à l'installation ou à la mise à jour d'une application au sein de Kubernetes mais aussi aller beaucoup plus loin en devenant de vrais Ops pour gérer vos applications pour vous !\nPuis, nous développerons un opérateur ensemble et en **Java** : un bon Hello World nous permettant de prendre en main le SDK Java mais aussi les différents éléments présentés au début du talk.\nEnfin, nous essaierons de nous projeter vers un opérateur faisant un peu plus que Hello World afin de voir si vraiment il sait faire de l'Ops !\nA la fin de ce talk, vous aurez les différents éléments pour savoir si vous avez besoin développer un opérateur, comment le développer, et choisir entre le faire en Java ou dans un autre langage !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "A GraphQL-based Schema Architecture for Microservices",
    "date": "2022-03-24T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/284773930/",
    "description": "Regardless of the schema language, there are three key problems in a schema architecture:\n* the reusability of data structure definitions* the expressivity of the schema language* the developer experience\nNav is a Small Business Lending platform built on a polyglot microservice architecture, complemented by an event bus. It is essential for us to develop a consistent way to validate our message payloads (APIs and events) across all microservices. Considering that it has one of the best DevX in the industry, we got the idea to use GraphQL as a schema language without any runtime component. After all, a GraphQL query describes the payload requested by a client, so why not use the same syntax to create a message definition and generate client-side and server-side validation code?\nNav’s Schema Architecture has been used in production since last September and we can already see some of the key benefits:\n* Rich validation rules* A consistent set of validation rules regardless of the language (Golang, Python, Ruby and JSON-schema).* An intuitive DevX that allows us to onboard engineers very quickly* A communication mechanism that conveys easily and precisely reusable data types across all payloads* A massive productivity gain with a 10-20X compression factor between the payload definition and the amount of generated code\nThese benefits proved to be very useful in the implementation of our event-driven architecture. We are now using for gRPC and protobuf as well.\n**Agenda:**\n* Introduction à GraphQL* Pourquoi a-t’on besoin de valider les payloads des APIs et des Événements?* Pourquoi ca ne marche pas avec les technologies classiques (json-schema par exemple)* Presentation du projet Nav Schema Architecture (FOSS)",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "AG 2022",
    "date": "2022-03-10T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/284450934/",
    "description": "Jeudi 10 Mars à 19h00 se tiendra l'Assemblée Générale ordinaire du Bordeaux JUG à l'ENSEIRB. **Cela se déroulera à l'étage à coté des salles de TDs.**\nLes soirées du BordeauxJUG sont organisées par des **bénévoles**. L'association **a besoin de volontaire** comme vous pour poursuivre ces activités.\nCe sera l'occasion pour l'équipe de faire une rétrospective sur l'année passée ainsi que d'élire un nouveau bureau.\nNous rappelons que l'AG est ouverte à tous. Par contre, seules les personnes ayant fait un don ou ayant souscrit au BordeauxJUG cette année pourront prendre part aux votes, et notamment à l'élection du futur bureau.\n**N'hésitez donc pas à verser votre obole**.\nVérifier que vous êtes à jour au niveau des cotisations sur la page [http://www.bordeauxjug.org/members](http://www.bordeauxjug.org/members) avant l'AG pour pouvoir voter !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Blockchain: fondements technologiques et cas d'usage",
    "date": "2021-12-09T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/282476863/",
    "description": "La blockchain est une technologie distribuée de stockage d'information et d'exécution de code informatique.\nElle repose sur des fondements technologiques et cryptographiques de plusieurs dizaines d'années qui en font une technologie extrêmement sécurisée.\nCette technologie est disruptive car elle permet de repenser la manière dont nos actifs peuvent être stockés, sécurisés et échangés et il existe maintenant tout un écosystème s'est construit autour de celle-ci.\nChez inBlocks, nous proposons une plateforme en mode SaaS pour permettre aux entreprises de créer de la valeur sur cette disruption.\nDans cette présentation nous parlerons donc à la fois des sous-jacents technologiques mais aussi des cas d'usage tels que la certification et l'horodatage d'informations numériques, la création de jetons (token) fongibles et non fonglibles (NFT) et décrirons comment nous avons pu aider Votelab (votelab.io) à lever plus de 3 M€ en 7 jours",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Java 17 la dernière LTS par Rémi Forax",
    "date": "2021-11-16T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/281736541/",
    "description": "Pour le retour du BordeauxJUG en présentiel, Rémi Forax, Docteur es Java, vient de Paris nous voir à l'ENSEIRB pour une présentation sur Java 17 la dernière LTS.\nLa version 17 de Java est sorti. Youpi !\nTrois ans de développement depuis Java 11, plein de choses à discuter donc c'est parti pour une nuit de 17h sur Java 17, nan, je rigole, on va parler que des changements du langage, cela sera déjà pas mal.\nDonc quoi de nouveau dans la version 17 du langage, une nouvelle sorte de chaine de caractère, une nouvelle sorte de classe spécialisée pour le données, une nouvelle sorte d'interface et un revampagedes switchs en prévision de l'introduction du pattern macthing.\nBien sûr, on va pas discuter uniquement de comment les nouvelles features marchent mais surtout pourquoi elles ont été designées comme cela,\net vers où on veut aller, enfin au moins vers où je pense que nous, la core team de Java, voulons aller.\nProgramme\n18h50 Accueil des participants\n19h00 News du JUG et news du monde Java\n19h et des brouettes : La présentation de Rémi : Java 17\n21h00 Buffet",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Quarkus World Tour s'arrête à Bordeaux",
    "date": "2021-09-16T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/280673402/",
    "description": "Trois Conférenciers :- Andy Damevin- Clément Escoffier- Loic Mathieu\nEmportée par le vent et dans un esprit très Rock’n Roll, l'équipe Quarkus lance sa tournée mondiale des zéniths.\nCes 25 dernières années, jamais Java, qui s’est produit partout dans le monde, n’avait connu un tel événement. Nous couvrirons les classiques comme “Start Me Up” et \"Living' on a VM\", mais également quelques nouveautés comme “ \"Stairway to Native\", \"Sweet JPA of Mine\" et bien d’autres encore.\nDurant ce concert, l’équipe Quarkus vous offrira une expérience “Hands-on” unique: Une introduction à Quarkus, suivi d’une ou deux demo “Hands-on” et pour terminer, une session Q&A avec les membres du groupe ... euh … des développeurs impliqués.\nAlors, rejoignez-nous ! Nous explorerons comment Quarkus aide les développeurs pour être plus productifs, créer des chef-d'œuvre modernes et tout ça dans le fun : 90 minutes exceptionnelles de discussion technique, live coding et Q&A - de quoi dépoussiérer vos classiques !\nAh et on aura également des goodies … comme des T-Shirts de la tournée peut-être?\nAllez, Time to rock the Java world 2021 style…\nPlus d'informations sur le http://www.bordeauxjug.org/",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "JUG Off 2021",
    "date": "2021-07-08T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/279257003/",
    "description": "Rassurez-vous nous n'allons pas vous demander de préparer le repas mais tout simplement d'échanger autour d'un bon repas.\nEn effet, depuis nos soirées en distanciel, nous n'avons pas eu l’occasion de nous retrouver après nos sessions et de partager ces bons moments.\nCette soirée est l'occasion de le faire, pour discuter ensemble du monde JAVA, de la JVM ou d'autres sujets amenés par les participants.\nCela sera aussi l'opportunité de retrouver l'équipe et de faire un point sur le BordeauxJUG donc n'hésitez pas à venir.\nA fin de réserver le nombre correcte, Merci de vous inscrire si vous êtes sûr de venir et de décommander si vous avez un empêchement. La date limite d'inscription est jeudi 08/07 à 12h.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "Alcala",
      "address": "Place Alcala de Henares, 33400",
      "city": "Talence",
      "country": "France"
    },
    "location": "Place Alcala de Henares, 33400, Talence"
  },
  {
    "title": "Java côté serveur : 22 ans et toujours fringuant !",
    "date": "2021-06-24T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/278914207/",
    "description": "Pendant 20 ans, Java EE a évolué à un train sénatorial. Depuis une dizaine d'années, les applications se sont transformées pour devenir cloud-natives. Java se trouve aujourd'hui contraint de s'adapter à ce nouveau contexte, en particulier pour fonctionner de manière optimum dans les infrastructures modernes basées sur Kubernetes:\n- Il doit permettre de développer facilement des applications observables et résistantes aux pannes,- Il doit devenir frugal en ressources systèmes, en particulier réduire sa consommation mémoire,- Il doit démarrer rapidement.\nCette présentation a pour but de démontrer les différentes options qui permettent d'atteindre ces objectifs :\n- L'évolution de Java EE vers Jakarta EE et MicroProfile,- L'offre logicielle autour des ces standards: Quarkus, OpenLiberty, Payara, KumuluzEE, TomEE, Helidon ...- GraalVM et les promesses du mode natif.\nLa présentation sera basée sur quelques slides, une démo inspirée d'un cas réel et des résultats de benchmarks récents.",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "Gradle 7: Le guide de survie Gradle",
    "date": "2021-05-20T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/278050081/",
    "description": "Gradle est un outil de build puissant, souvent comparé à Maven, mais cette comparaison induit souvent des problèmes de compréhension parce qu'ils ont un modèle en pratique bien différent.\nDans cette présentation, nous proposons une introduction à Gradle, quels sont les concepts de base, quelles commandes invoquer, ce qu'est un build script, etc... dans l'objectif d'avoir à l'issue de la session les bases nécessaires à lire et commencer à écrire des builds Gradle.\nPlus d'informations sur notre site https://www.bordeauxjug.org",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "Java 16 - Les nouveautés",
    "date": "2021-04-22T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/277451860/",
    "description": "Java 16 est disponible depuis mars 2021. Java évolue rapidement avec cette cadence de sortie tous les 6 mois. Chaque version apporte son lot de nouveautés et la version 16 ne déroge pas à la règle.\nCependant, selon le dernier rapport 2021 de la société Snyk sur l'éco-système JVM, nous voyons que deux développeurs sur trois utilisent le JDK 8 en production et seulement un développeur sur quatre utilise un JDK 11.\nSi chaque version est intéressante, la version 16 est très intéressante à deux titres :- Certaines fonctionnalités en mode aperçu (\"Preview\") arrivent en standard dans le langage,- La prochaine version, Java 17, est une version LTS (Long-Term Support)\nJe vous présenterai les nouvelles fonctionnalités. Pour cela, rien de mieux que de coder en direct afin de bien comprendre leurs intérêts.\nCela va transformer votre manière de coder et vous vous demanderez après comment vous avez fait sans.\nVenez me rejoindre !\nPlus d'information sur le site du JUG : http://www.bordeauxjug.org",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "AG 2021",
    "date": "2021-03-22T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/277008416/",
    "description": "Lundi 22 Mars à 19h00 en visio (sans inscription) se tiendra l'Assemblée Générale ordinaire du Bordeaux JUG.\nLes soirées du BordeauxJUG sont organisées par des bénévoles. L'association a besoin de volontaire comme vous pour poursuivre ces activités\nCe sera l'occasion pour l'équipe de faire une rétrospective sur l'année passée ainsi que d'élire un nouveau bureau.\nNous rappelons que l'AG est ouverte à tous. Par contre, seules les personnes ayant fait un don ou ayant souscrit au BordeauxJUG cette année pourront prendre part aux votes, et notamment à l'élection du futur bureau.\nN'hésitez donc pas à verser votre obole sur http://www.bordeauxjug.org/members avant l'AG pour pouvoir voter !",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "JHipster ❤️ Quarkus: Supersonic, Subatomic Full Stack Application",
    "date": "2021-03-11T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/276719004/",
    "description": "D'un côté JHipster, LE générateur d'application le plus connus de l'écosystème Java pour générer des applications fullstack.\nDe l'autre Quarkus, le dernier framework de Red Hat qui annonce des performances époustouflantes.\nL'occasion était trop belle, rajouter un backend Quarkus à JHipster en utilisant le concept de \"blueprint\".\nDurant cette présentation, nous aborderons les points suivants:- C'est quoi JHipster et surtout c'est quoi un blueprint- C'est quoi Quarkus et pourquoi autant de hype.- JHipster-Quarkus* Comment l'installer* Generation d'une app de commerce en ligne avec un backend Quarkus qui pèse 80M de mémoire et démarre en 0.0.1* Generation d'une entité en passant par le formulaire en CLI* L'utilisation du JDL (JHipster Description Language) pour aller encore plus vite- Comment aller plus loin- Le futur.\nMore information on http://www.bordeauxjug.org",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "Hibernate in complex projects – Can we be a little faster?",
    "date": "2021-02-18T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/276178510/",
    "description": "Hibernate is the de-facto standard for persisting data in a relational database. It provides excellent developer productivity and is so easy to use that you can learn it within a few hours.\nThat changes as soon as your application needs to handle a huge amount of data or if you want to guarantee very short response times. Features and concepts that work perfectly fine for smaller applications start to become a burden that slows down your application.\nBut that doesn’t have to be the case for your application. Hibernate is a great fit for complex projects with high-performance requirements. You only need to know which features to use and which you should better avoid.\nDuring this talk, I will show you how to get the most out of your Hibernate-based persistence layer. By following these recommendations, you will be able to enjoy Hibernate’s developer productivity and provide a blazingly fast experience to your users.\nMore information on http://www.bordeauxjug.org",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "Don't fear outdated caches -- change data capture to the rescue! ",
    "date": "2021-01-21T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/275773605/",
    "description": "The saying goes that there are only two hard things in Computer Science: cache invalidation and naming things.\nWell, turns out the first is solved actually ;)\nCome and join us for a session to hear not about one, but two popular open-source projects.\nFirst, Infinispan, an in-memory distributed data store and cache, which is elastically scalable, highly availability and fault-tolerant.\nThen, Debezium, a change data capture (CDC) platform for a variety of databases, such as MySQL, PostgreSQL and MongoDB.\nAfter an overview of the key use cases and capabilities of the two projects, we'll explore in a demo how you can combine Debezium and Infinispan for even greater awesomeness:\nHow to keep your cache automatically up-to-date after data changes via Debezium and CDC\nHow to read denormalized views of your data with plain key look-ups from an Infinispan cluster close by\nHow to propagate cache updates between clusters using cross-site replication\nAll this driven by Quarkus and connected via Apache Kafka. Bring your questions and ideas so we can discuss and exchange about the potential of these open-source projects in the data space!\nMore information on http://bordeauxjug.org",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "3 easy improvements in your microservices architecture",
    "date": "2020-12-17T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/275058477/",
    "description": "While a microservices architecture is more scalable than a monolith, it has a direct hit on performance.\nTo cope with that, one performance improvement is to set up a cache. It can be configured for database access, for REST calls or just to store session state across a cluster of server nodes. In this demo-based talk, I’ll show how Hazelcast In-Memory Data Grid can help you in each one of those areas and how to configure it.\nHint: it’s much easier than one would expect\nPlus d'informations sur le site http://www.bordeauxjug.org/",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "Plug-in Architectures for Java with Layrry and the Java Module System",
    "date": "2020-11-19T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/274507026/",
    "description": "The Java Module System lays the foundation for building modularized applications on the JVM. It doesn’t concern itself though with resolving module versions and obtaining modules from repositories.\nThis is where Layrry comes in: an API and launcher for modularized Java applications which takes a descriptor of the module layer(s) to assemble, fetches the modules and starts up the application.\nJoin us for this session and learn how to:\nBuild Java applications using layers, e.g. providing isolation between different versions of one module. Use jbang to launch your layered apps in no time. Create plug-in based rich-client applications using JavaFX and Layrry, allowing to – dynamically reconfigure and update your layer hierarchy, no restarts required. Create your own customized Layrry launcher if needed\nThis session is code-centered, be ready to see the Java Module System, Layrry, and JavaFX in action!\n-- Session in English / Session en anglais",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "Mieux maîtriser la performance applicative avec la librairie de test QuickPerf",
    "date": "2020-10-15T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/273864451/",
    "description": "La performance est souvent considérée de manière tardive, voire ignorée, dans le cycle de développement applicatif. Ceci induit un risque de découvrir tardivement que l'application est lente ou inutilisable.\nVous allez découvrir comment la librairie de test QuickPerf (https://github.com/quick-perf/quickperf) permet de supprimer sans beaucoup d'effort et au plus tôt des goulets d'étranglement de performance.\nSi votre application possède déjà des tests de performance, comme des tirs de charge, vous verrez comment les tests QuickPerf peuvent les compléter et vous faire gagner du temps\nPlus d'informations sur le site de votre JUG (http://www.bordeauxjug.org)",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "Spring Boot Loves K8s",
    "date": "2020-09-10T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/272912566/",
    "description": "Containers and platforms are now part of the developer’s toolbox;\nit’s sometimes hard to standardize the containerization and deployment of Spring Boot applications in your organization, while still remaining flexible.\nSpring Boot 2.3 is out now with new features for containers and Kubernetes.\nDuring this session, Stephane and Brian will share with you the Spring Boot 2.3 features that will help you to:\n- Easily create optimized container images of your application\n- Simplify and standardize your CI/CD pipeline\n- Manage the lifecycle of your application in a Kubernetes environment with Probes\nAnd more!\nPlus d'informations sur le site de votre JUG (http://www.bordeauxjug.org)",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "JUG Off 2020",
    "date": "2020-07-09T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/271759227/",
    "description": "Le mois de juin s'est terminé et cela sent bon les vacances.\nLors des dernières soirées à distance (depuis Avril), nous n'avons pas eu l’occasion de nous retrouver après la session et de partager des bons moments.\nCette soirées est l'occasion de le faire, pour discuter du monde JAVA, de la JVM ou d'autres sujets amenés par les participants.\nCela sera aussi l'opportunité de retrouver l'équipe et de faire un point sur le BordeauxJUG donc n'hésitez pas à venir.\nDans le contexte actuel, le nombre d'inscription est limité à 10.\nA fin de réserver le nombre correcte, Merci de vous inscrire si vous êtes sûr de venir et de décommander si vous avez un empêchement. La date limite d'inscription est jeudi 09/07 à 12h.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "Alcala",
      "address": "Place Alcala de Henares, 33400",
      "city": "Talence",
      "country": "France"
    },
    "location": "Place Alcala de Henares, 33400, Talence"
  },
  {
    "title": "Profiling et monitoring de JVM avec Arthas",
    "date": "2020-06-25T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/271338389/",
    "description": "Arthas est un outil open source de diagnostic Java open source développé par Alibaba pour ses propres besoins. Il propose des fonctionnalités de monitoring et de profiling qui peuvent aider à identifier de nombreux problèmes dans des applications exécutées dans une JVM sans avoir à la redémarrer. C'est un outil en mode console qui permet de se connecter à une application Java en cours d'exécution.\nCette session présentera cet outil utile qui peut aider à résoudre des problèmes lors de l'exécution d'application dans un JVM.\nPlus d'informations sur le site de votre JUG (http://www.bordeauxjug.org)",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "Artificial Intelligence on Quarkus: I love it when an OptaPlan comes together",
    "date": "2020-05-28T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/270786885/",
    "description": "Forget about Machine Learning. Planning optimization is the most profitable AI technology on this planet.\nThe world is full of planning challenges, such as vehicle routing problems, maintenance scheduling and employee rostering. Find the quickest routes to visit n locations with k vehicles. Assign n shifts to k employees, taking into account skills and availability. Few people realize how much AI algorithms improve those solutions.\nFor example, when telco's started using OptaPlanner to plan their fleet of technicians, many expected a driving time reduction of 1-2%. It was 25%. In some cases, that saves them hundreds of millions of dollars and millions of kilograms of CO² emissions, every year.\nIn this session I'll show you how to code a highschool timetabling application from scratch, with Quarkus and OptaPlanner. It 'll generate the perfect lesson schedule, for both students and teachers.\nPlus d'informations sur le site de votre JUG (http://www.bordeauxjug.org)",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "La concurrence sans s’emmêler les ficelles avec Project Loom",
    "date": "2020-04-30T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/270182876/",
    "description": "Le domaine de la programmation concurrente utilise le champ lexical de la filature et nous met les nerfs en pelote avec des concepts qui s'entrelacent : fibers, threads, lightweight-threads, green threads, loom... Peut-être avez vous également entendu parler de coroutines ? Rassurez-vous, tout est lié.\nAu fil de cette présentation (em)mêlée d'exemples de code, vous découvrirez le projet Loom qui a pour vocation d'apporter à la JVM des \"mécanismes léger de concurrence\", ainsi que des API plus haut niveau pour broder dessus.\nNous aborderons ensemble l'origine de Loom et ses récents prototypes. Vous vous apercevrez que son maillage va au delà de \"simples\" primitives et peut nous amener jusqu'à révolutionner la concurrence sur la JVM.\nPlus d'informations sur le site de votre JUG (http://www.bordeauxjug.org)",
    "community": "bordeauxjug",
    "is_online": true
  },
  {
    "title": "Montée de version sans interruption de services",
    "date": "2020-02-20T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/268624020/",
    "description": "De plus en plus d'éditeurs logiciels fournissent leurs solutions en SaaS, et tendent à déployer leurs applications en Continuous Delivery. Pour cela, les contraintes business impliquent souvent de pouvoir déployer une nouvelle version applicative sans interruption de service.\nLes techniques classiques de Rolling Update permettent de réaliser une montée de version sans interruption de service assez facilement. La complexité intervient lorsque l'on gère une base de données relationnelle, et que l'on souhaite faire évoluer son schéma, le tout, toujours sans interruption de service.\nDepuis 3 ans, au sein de Mirakl, nous avons mis en place un système de montée de version sans interruption de service avec une base relationnelle.\nCe talk est un retour d'expérience présentant les mécanismes que nous avons mis en place pour réaliser ces montées de version sans interruption. Il se concentre sur la partie applicative, et les problématiques engendrées par un tel process.\nLe but est d'être le plus concret possible, avec des exemples de \"la vraie vie\", notamment quelques astuces pour réaliser ses migrations sans douleur avec des frameworks comme Hibernate ou jOOQ. Les exemples sont donnés en Java avec une base de données PostgreSQL, mais les principes s'appliquent à n'importe quel langage et à la plupart des bases de données relationnelles.\nPlus d'information sur le site du BordeauxJUG (http://www.bordeauxjug.org/)",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "News du support de Kotlin dans Spring ? Et Spring Boot avec GraalVM native",
    "date": "2020-01-23T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/267666612/",
    "description": "Quoi de neuf sur le support de Kotlin dans Spring ?\nLa première partie de cette conférence donnera un aperçu de l'état de l'art du développement d'applications Spring Boot 2.2 avec Kotlin:\n- Data classes immutables avec @ConfigurationProperties- Tests avec JUnit 5 et Mockk- La nouvelle DSL “router” pour Spring MVC- Le support des Coroutines sur WebFlux, RSocket et Spring Data- Les exemples de code en Kotlin dans la documentation de référence- La DSL MockMvc\nUn rappel des bonnes pratiques (extensions, injection de dépendances via constructeur)\nLa seconde partie sera un live coding d'une application Spring Boot configurée avec Kofu, la DSL Kotlin actuellement développée dans l'incubateur Spring Fu que j'ai créé il y a quelques mois. Il s'agit d'une alternative à l'auto-configuration Spring Boot conçue pour configurer votre application de manière explicite en utilisant l'auto-complétion et des \"slices\" de configuration tout en supportant la plupart des fonctionnalités de Spring Boot.\nSpring Boot avec GraalVM native\nDans cette conférence, Sébastien partagera les dernières informations sur le travail en cours effectué par l'équipe Spring afin de permettre de compiler les applications Spring Boot en exécutables natifs permettant ainsi un démarrage instantané et une consommation mémoire réduite. Il présentera le futur support prévu pour Spring Framework 5.3, et fera différentes démonstrations d'applications Spring Boot natives.Ce sera également l'occasion pour une comparaison pragmatique entre les plateformes OpenJDK, GraalVM Community Edition et GraalVM Enterprise Edition avec des chiffres concrets.\nProgramme\n18h50 Accueil des participants\n19h00 News du JUG et news du monde Java\n19h10 Support Kotlin dans Spring, suivi de Spring boot avec GraalVM\n21h00 Buffet",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "AG 2020",
    "date": "2020-01-16T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/267863950/",
    "description": "Jeudi 16 Janvier à 19h00 à l'ENSEIRB (1er étage à coté des salles de TD) se tiendra l'Assemblée Générale ordinaire du Bordeaux JUG.\nLes soirées du BordeauxJUG sont organisées par des bénévoles. L'association a besoin de volontaire comme vous pour poursuivre ces activités\nCe sera l'occasion pour l'équipe de faire une rétrospective sur l'année passée ainsi que d'élire un nouveau bureau, tout cela autour d'un bon buffet (évidemment !).\nNous rappelons que l'AG est ouverte à tous. Par contre, seules les personnes ayant fait un don ou ayant souscrit au BordeauxJUG cette année pourront prendre part aux votes, et notamment à l'élection du futur bureau.\nN'hésitez donc pas à verser votre obole sur http://www.bordeauxjug.org/members avant l'AG pour pouvoir voter !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "La modularité au (micro) service de l'espace client Orange",
    "date": "2019-12-12T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/266994044/",
    "description": "En 2017, l'espace client web d'Orange était une application monolithique capable de gérer 15 millions de visiteurs uniques par mois, avec un fonctionnel vaste, allant de la récupération du code puk à la souscription de nouvelles options. Au fil des années passées et des évolutions, la complexité et la dette technique se sont accumulées sur ce monolithe. Il affichait alors ses limites pour adresser la multicanalité et ne permettait plus d'absorber les évolutions dans un délai raisonnable.\nLorsqu'une application devient trop grosse, le découpage en micro-services est une bonne alternative. Mais quand on veut casser des monolithes pour en faire des micro-services, tout en préservant le legacy afin d'éviter le big bang, c'est tout de suite beaucoup moins simple.\nDans ce talk nous vous présenterons les étapes de la transformation digitale de l'espace client Orange, qui ont permis de réconcilier différents fronts et différents backs dans une architecture micro-services et micro-frontends.\nCe talk décrit les enjeux et les difficultés à faire évoluer une architecture monolithique vers une architecture modulaire au sein d'une grande organisation comme Orange, sur des applications Web et natives au coeur d'un business générant plusieurs millions de visites par mois.\nA travers un retour d'expérience sur les deux dernières années, nous vous présenterons les solutions qui nous ont permis de mettre de la cohérence et de la modularité dans un SI qui était composé jusque-là de beaucoup d'applications monolithiques, difficiles à faire évoluer.\nLe talk, sous forme de slides, aborde les concepts suivants : micro-services, micro-frontends, API, multi-canalité, Hypermedia, DevOps, mises en prod incrémentales.\nFrédéric et Fabien sont développeurs chez Orange et travaillent sur l'espace client grand public (Apps et Web), ils sont également membres de la communauté d'experts Orange, et animent régulièrement en interne des talks, webinars et autres retours d'expérience sur des sujets variés tels que l'architecture logicielle et le développement Android/iOS/Web.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Introduction à la programmation par contraintes",
    "date": "2019-11-21T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/266232132/",
    "description": "Cyril Delmas viendra nous parlera de concepts autour de la programmation par contraintes.\n\"Quel est le point commun entre un jeu de sudoku, la planification d'une conférence et les déplacements d'un commercial ?\nQuand on souhaite les traiter automatiquement, tous ces problèmes peuvent être résolus par un solveur de contraintes.Dans ce talk, je vais essayer de vous faire une introduction pratique à la programmation par contraintes, en présentant les concepts de base, puis en les mettant en application avec plusieurs exemples de problèmes connus de tout le monde (ou presque), pour finir par un cas plus complexe sur lequel j’ai travaillé.\"\nPlus d'informations sur le site du JUG : http://www.bordeauxjug.org/",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "La JVM et Docker, vers une symbiose parfaite !",
    "date": "2019-10-17T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/265368300/",
    "description": "David Delabassée viendra nous parlera : La JVM et Docker, vers une symbiose parfaite !\nLes containeurs sont devenus en l'espace de quelques années un standard de-facto pour le déploiement de notre code que ce soit dans le Cloud ou 'On-premises', que ce soit pour des applications plus traditionnelles ou pour des fonctions Serverless.\nLes containeurs sont omniprésents, Docker en tête. De nouvelles plateformes, de nouveaux outils et frameworks ont rapidement émergés (ex. Knative, OpenFaas, Fn, JIB...) afin de simplifier l'utilisation de Docker. Parfois même, on utilise Docker sans nécessairement le savoir, Docker à l’insu de notre plein gré!\nCette session discute différentes approches et techniques afin d’optimiser l'utilisation de Java et de la JVM dans des containers Docker. Nous allons aborder des points tels que Jlink, CDS et AppCDS, Graal SVM, Project Portola, etc. Nous allons enfin discuter de certaines améliorations présentes ou à venir qui visent à améliorer les interactions entre la JVM et Docker.\nBien que le langage Java soit utilisé pour cette session, cette discussion n’est en rien spécifique à Java et est applicable à tous les langages tournant sur la JVM, Kotlin, Groovy, Scala, etc.\nPlus d'informations sur le site du JUG : http://www.bordeauxjug.org/",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Quarkus: Supersonique Subatomique Java ",
    "date": "2019-09-05T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/263399748/",
    "description": "Les microservices, la scalabilité instantanée et les plates-formes à haute densité comme Kubernetes nécessitent des applications à faible empreinte mémoire et démarrage rapide.\nJava n'était pas bien positionné car il favorise les temps de traitement aux dépens du CPU et de la RAM.\nPlus maintenant.\nEntre en scène Quarkus, une stack Java orientée microservices qui supporte vos composants favoris (Hibernate, Vert.x, Camel, RESTEasy ...) sur GraalVM et HotSpot avec une faible empreinte mémoire et un démarrage rapide.\nTout ce qu'il faut pour tirer pleinement parti des containers.\nLa gestion de la donnée est souvent l'aspect le plus complexe : découvrons comment Quarkus gère la persistance avec Hibernate ORM.\nVenez explorer :\n- le live reload,\n- notre vision de la persistance avec Hibernate Panache,\n- l'environnement de test,\n- la compilation native\n- GraalVM et bien plus.\nQuarkus se vit plus qu'il ne se verbalise,attendez-vous à une démo détaillée.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "JUG Off 2019",
    "date": "2019-07-11T19:30:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/262595991/",
    "description": "Le mois de juin se termine et cela sent bon les vacances.\nC'est l'occasion pour se retrouver autour d'une table pour discuter du monde JAVA, de la JVM ou d'autres sujets amenés par les participants.\nCette année, nous changeons de style, nous partons au japon, pays du Sushi, Maki et autres.\nCela sera aussi l'opportunité de retrouver l'équipe et de faire un point sur le BordeauxJUG donc n'hésitez pas à venir.\nAttention afin de pouvoir réserver, la limite des inscriptions est fixée au 10 juillet à 14h.\nA fin de réserver le nombre correcte, Merci de vous inscrire si vous êtes sûr de venir et de décommander si vous avez un empêchement.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "Alcala",
      "address": "Place Alcala de Henares, 33400",
      "city": "Talence",
      "country": "France"
    },
    "location": "Place Alcala de Henares, 33400, Talence"
  },
  {
    "title": "Le DDD et les patterns tactiques",
    "date": "2019-06-06T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/261789353/",
    "description": "Le DDD (Domain Driven Design) rapproche le code source des applications de leurs préoccupations métiers.\nLes patterns tactiques DDD ciblent les aspects techniques en structurant le code source et en résolvant nombre de problèmes de conception.\nCette présentation mettra en lumière ces avantages en illustrant les patterns tactiques Value Object, Entity et Aggregate et en précisant leur lien avec l'architecture hexagonale\nPlus d'informations sur le site du JUG : http://www.bordeauxjug.org/",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Java 11, 12.. c'est le moment de remplacer son JDK 8",
    "date": "2019-05-16T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/261250540/",
    "description": "Java 12 est sorti comme prévu en mars dernier.Java 11 est sorti en septembre dernier, estampillé LTS (Long Term Support)\nQue de changement depuis Java 8 ?\n- Nouvelle sortie de Java tous les 6 mois- Notion de LTS- Java 9 et ses fameux modules- Changement de licence d'Oracle\nAprès la sortie de Java 9, 10, 11, et 12 c'est le moment de franchir le cap et de changer de JDK. Nous verrons les nouveautés, les points d'attention.\nEn clair, tout ce que vous devez savoir pour commencer ou migrer votre projet en Java 11 en douceur.\nPlus d'informations sur le site du JUG : http://www.bordeauxjug.org/",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Construire une architecture élastique basée sur les événements dans AWS",
    "date": "2019-04-25T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/260351006/",
    "description": "Les architectures à base d'événements, vous connaissez, mais comment mettre en place un event bus fiable, scalable et performant dans le cloud ?\nComment ne pas se ruiner dans le processus ?\nComment faire collaborer les équipes ?\nVenez découvrir notre périple de ces derniers mois pour répondre à ces questions !\nAu programme:\nde l'AWS (SNS/SQS, Kinesis),\ndu Kotlin,\ndu monitoring (Elastic stack),\net bien plus !\nPlus d'informations sur le site du http://www.bordeauxjug.org",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Etre productif avec JHipster",
    "date": "2019-03-21T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/259556423/",
    "description": "JHipster est une plateforme de génération de code 100% open source et populaire dans le monde Java.\nJHipster est utilisé par de nombreuses entreprises pour accélérer le développement d'applications Cloud Native basées sur Spring Boot et Angular/React/Vue.js et les déployer dans le cloud.\nPartie 1 : Introduction à JHipster 5\nNous ferons un tour rapide de la pléthore d'options, de technologies et d'outils qui sont intégrés par JHipster pour accélerer et faciliter vos développements.\nPartie 2 : Développer une architecture microservice avec JHipster\nJHipster inclue le support de deux technologies concurrentes qui promettent d'offrir scalabilité et résilience aux architectures microservice: Spring Cloud et Istio.\nDans cette présentation, nous utiliserons JHipster pour générer des microservices et leur configuration de déploiement, ce qui nous permettra de délivrer rapidement un PoC d'architecture complet.\nPlus d'informations sur le site http://www.bordeauxjug.org",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Back to Basics : Ne perdez plus votre Temps avec les Dates",
    "date": "2019-02-21T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/258695264/",
    "description": "La gestion du Temps sur une application client/serveur peut sembler simple de prime abord, mais se révélera beaucoup plus complexe au fur et à mesure des usages : timezones multiples, heures récurrentes, heure d'été/d'hiver, traitements cron, leap seconds sont des exemples parmi tant d'autres. Saviez-vous même que la Commission Européenne envisage d'abolir le passage en heure d'hiver ? Quels impacts cela aurait sur nos applications ?\nMon objectif : qu'à partir de lundi prochain, vous vous posiez les bonnes questions à chaque fois que vous travaillerez sur une date ou une heure dans vos applications.\nPour cela, reprenons les bases du Temps en informatique : composantes d'une date, norme ISO 8601, Timezones et IANA.\nUne fois ces bases posées, nous verrons, au travers d'un certain nombre de cas d'utilisation issus de la vraie vie, les bonnes questions qu'il convient de se poser pour mettre le doigt sur les complexités d'implémentation et éviter de tomber dans une faille spatio-temporelle lors du prochain changement d'heure.\nCe talk est accessible à tous et ne se focalisera pas sur un langage / une API en particulier : les concepts prévaudront sur le code\nPlus d'informations sur le site http://www.bordeauxjug.org",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Micronaut puis Flutter",
    "date": "2019-01-17T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/257938877/",
    "description": "Vous développez des API qui tournent sur la JVM ? Vous êtes adeptes du principe de \"Convention plutôt que configuration\" et préférez vous concentrer sur les problèmes à forte valeur ajoutée plutôt que réinventer la roue au quotidien ?Si c'est le cas, vous avez sûrement choisi d'adopter Spring Boot ou Grails pour leurs auto-configurations à base d'annotations, leurs déploiements facilités et leurs nombreux starters.\nCependant, vous avez peut-être remarqué que ces frameworks peuvent avoir des limites : Les conventions, c'est bien... jusqu'au moment où c'est vieux ! Si Spring Boot s'adapte régulièrement aux nouvelles pratiques standards, on finit quand même souvent par devoir ajouter des briques ou de la configuration dans tous les sens pour s'adapter aux comportements, technologies ou manières de déployer de 2019.\nSi Spring Cloud vous permet par exemple de faire des microservices confortablement, vous n'échapperez pas à l'énorme cache utilisé par Spring Boot pour stocker des données liées à son mécanisme de réflexion, avec temps de démarrage et utilisation de mémoire qui s'en suivent.\nVous pourrez donc dire adieu à la scalabilité agressive qu'offrent ce genre d'architectures et le serverless restera pour vous un doux rêve... ou pas !\nEn Octobre dernier, l'équipe de Grails a livré la première version stable de Micronaut : un microframework pour Java, Kotlin et Groovy, inspiré de Spring Boot et Grails et destiné à répondre à ces problèmes de manière efficace.\nMick et Yohan vous présenteront les principales fonctionnalités de Micronaut (compilation AoT, discovery, retry, tracing, reactive programming etc.) autour d'une démo, suivie d'un moment d'échange sur des fonctionnalités plus avancées et des problématiques de tous les jours.\nFlutter avec Laurent Forêt\nFlutter vous en avez entendu parler ? Si ce n'est pas encore le cas, incessamment sous peu, vous ne pourrez pas imaginer utiliser d'autres technologies pour développer vos applications Android et IOS.\nAfin de découvrir ce nouveau projet de Google sortie en 1.0, il y a peu, je vous propose un petit livecoding entre-amis afin d'appréhender cette approche de développement orienté composant.\nÇa va darter !!\nPlus d'informations sur le site du JUG (http://www.bordeauxjug.org)",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "AG 2019",
    "date": "2019-01-10T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/257862112/",
    "description": "Jeudi 10 Janvier à 19h00 à l'ENSEIRB (1er étage à coté des salles de TD) se tiendra l'Assemblée Générale ordinaire du Bordeaux JUG.\nLes soirées du BordeauxJUG sont organisées par des bénévoles. L'association a besoin de volontaire comme vous pour poursuivre ces activités\nCe sera l'occasion pour l'équipe de faire une rétrospective sur l'année passée ainsi que d'élire un nouveau bureau, tout cela autour d'un bon buffet (évidemment !).\nNous rappelons que l'AG est ouverte à tous. Par contre, seules les personnes ayant fait un don ou ayant souscrit au BordeauxJUG cette année pourront prendre part aux votes, et notamment à l'élection du futur bureau.\nN'hésitez donc pas à verser votre obole sur http://www.bordeauxjug.org/members avant l'AG pour pouvoir voter !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Web components en 2018, on en est où ?",
    "date": "2018-12-13T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/257016263/",
    "description": "Depuis quelques années on a entendu parler des web components, ce beau discours d'un développement web basé enfin sur une vraie architecture en composants, de la réutilisation, de la modularisation, de l'encapsulation...\nMais force est de constater que aujourd'hui, en fin 2018, cette vision a du mal à se concrétiser, les frameworks comme React, Angular ou Vue ont encore la part belle des feux des projecteurs et le discours des web components sont presque inaudibles.\nEt pourtant plein de choses se sont passées cette dernière année, et les web components sont aujourd'hui sur plein de sites et des applications que nous utilisons tous les jours, sans qu'on les remarque. La révolution est bien en marche, mais elle est plutôt silencieuse...\nDans ce talk on va commencer par faire un tour de table sur les différentes bibliothèques de web components disponibles aujourd'hui, leurs caractéristiques, leur philosophie et leurs use cases.\nEnsuite on va se centrer sur le futur de mon projet favorite : Polymer. La v3 est sortie il y a quelques mois, et en plus de mettre enfin l'outillage en phase avec les standards du marché (npm...) elle nous annonce un beau futur avec des composants plus légers, plus performants, plus proches de la plateforme et avec un rendering basé sur vrai concurrent de JSX mais qui s'intègre 100% sur les standards du web : lit-html. On parlera donc de LitElement, on fera des demos, on verra du code...\nPour finir on va voir comment il est simple aujourd'hui d'intégrer les web components sur n'importe quel project web, du legacy avec jQuery à la dernière app avec React, du projet en Angular à l'application en Vue JS. Des composants interopérables plug and play pour vos applications qui montrent encore une fois l'intérêt de cette révolution des web components.\nPlus d'informations sur le site du JUG (http://www.bordeauxjug.org)",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Au delà des brokers: un tour de l'environnement Kafka",
    "date": "2018-11-15T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/256161168/",
    "description": "Florent Ramière nous présentera au delà des brokers : un tour de l'environnement Kafka\nApache Kafka ne se résume pas aux brokers, il y a tout un écosystème open-source qui gravite autour. Je vous propose ainsi de découvrir les principaux composants comme Kafka Streams, KSQL, Kafka Connect, Rest proxy, Schema Registry, MirrorMaker, etc.\nVenez avec vos questions, plus la session sera interactive, meilleure elle sera !\nPlus d'informations sur le site du JUG",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Ceinture noire Karate en tests d'API REST",
    "date": "2018-10-11T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/255244535/",
    "description": "Au programme de la soirée, nous commençons par un Quickie avec Benoit PRIOUX : \"Property Based Testing : La vérité vraie !\"\nVous faites des tests unitaires, vous maîtrisez le TDD, mais connaissez-vous le Property Based Testing ?A travers un live coding en java avec la librairie jqwik, je vous monterai les bases de cette technique et en quoi elle est complémentaire aux techniques de test classiques.\nNous pousuivrons notre soiée par la présentation de l'outil KARATE par Benoit PRIOUX et Nicolas COMET : \"Ceinture noire Karate en tests d'API REST\"\nVous aviez toujours rêvé d'une syntaxe facile pour tester vos APIs REST ?\n`Karate` est fait pour vous ! Son format DSL plain text inspiré de la syntaxe Cucumber (ie. Gherkin) permet même aux personnes aux notions basiques en développement de venir couvrir vos APIs ou Web services (micros, nanos ou pas!)\nIl n'y a plus Karate, ehm, pardon... qu'à réussir ses tests d'intégration !\nPlus d'informations sur le site du JUG",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Soirée Apache Maven",
    "date": "2018-09-20T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/254457225/",
    "description": "Présenté par Hervé Boutemy, nous avons deux présentations vis à vis du projet Apache Maven.\nPlus d'informations sur le site du JUG http://www.bordeauxjug.org/\n*Maven et Java 9*\nMaintenant que Java 9 est sorti, on va pouvoir ajouter des descripteurs de modules dans tous nos projets, n'est-ce pas?Pas si sûr...Les modules Java 9 sont très puissants, mais sans maîtrise, ils risquent de tout casser non seulement au niveau de vos programmes Java mais aussi au niveau de l'écosystème Maven.Avez vous déjà réfléchi au nom de module de votre jar ? Un conseil d'ami : ne vous contentez pas du nom par défaut.Cette session vous donnera de nombreux conseils pratiques qui ne sont pas directement dans la spécification, mais qui doivent absolument être gardés en tête au fil de l'adoption générale du système de modules Java.\n*Maven 3 & 5*\nCa fait bien longtemps que Maven 3 est sorti. Depuis, il n'y a que des releases mineures : plus rien de bouge ? C'est mort ? Même pour Java 9, il n'y a pas eu besoin de release Maven !Je vous rassure, Maven continue d'évoluer : simplement, il le fait sans bruit inutile et en vous garantissant une évolution à votre rythme. Pourtant, une évolution majeure va être nécessaire, qui méritera une nouvelle version : Maven 5.Pourquoi pas 4 ? Quelle est cette évolution ?Et comment l'équipe Maven va t'elle faire pour conserver la stabilité à laquelle on était habitués, malgré ce grand changement ?.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "JUG Off 2018",
    "date": "2018-07-12T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/252304027/",
    "description": "Les vacances arrivent, c'est l'occasion de se retrouver autour d'une table pour discuter du monde JAVA, de la JVM ou d'autres sujets amenés par les participants.\nCela sera aussi l'opportunité de retrouver l'équipe et de faire un point sur le BordeauxJUG donc n'hésitez pas à venir.\nAttention afin de pouvoir réserver, la limite des inscriptions est fixée le 11 juillet à 14hNe vous inscrivez uniquement si vous compter venir.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "Alcala",
      "address": "Place Alcala de Henares, 33400",
      "city": "Talence",
      "country": "France"
    },
    "location": "Place Alcala de Henares, 33400, Talence"
  },
  {
    "title": "Mettre en place simplement la sécurité de ces applications avec Keycloak",
    "date": "2018-06-20T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/251623732/",
    "description": "Présenté par Lilian BENOIT\nAu programme de la soirée, nous allons voir comment sécuriser simplement une application classique, front et back, sans être un expert en sécurité mais de manière fiable.\nJe commencerai par les raisons de déléguer sa gestion de sécurité à un produit comme Keycloak. C'est un projet open-source mature, facile à installer, flexible au niveau de l'utilisation. Il reste indépendant du langage grâce à l'usage des protocoles standards comme Open ID Connect et SAML\nEnsuite, nous attaquons à la mise en pratique. En effet, j'ai dit simplement donc nous allons voir comment installer Keycloak et comment sécuriser ma première applicaton.\nNous ferons un tour des fonctionnalités de l'outil et de ce qu'il propose. Nous poursuivrons par voir toujours avec des démonstrations comment sécuriser d'autres types applications comme un services web, une application Angular (Il n'y pas que Java dans la vie ;-)",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Soirée BlockChain",
    "date": "2018-05-17T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/250558478/",
    "description": "Présenté par la team Crash'Teq\nLa Crash'Teq team arrive du Luxembourg pour vous parler de Blockchain !\nAu programme de cette soirée, une introduction généraliste sur les concepts : quels sont les principes de ces fameuses technologies Blockchain, du point de vue du développeur ? Comment cela fonctionne, et pourquoi est-ce différent des architectures traditionelles ? Comment code-t'on \"pour la Blockchain\" ? Quelles sont les différences entre Ethereum et Bitcoin ? Nous verrons ensemble comment écrire un premier Smart Contract, et comment le déployer sur le réseau en live !\nAprès cette introduction, nous partagerons avec vous nos retours d'expérience du terrain. Sur différents projets, nous avons déployé en production des applications basées sur la Blockchain. Nous vous proposerons donc un petit aperçu des problématiques rencontréessur ces différents projets : peut-on tout stocker dans la blockchain ? Comment intégrer ces architectures décentralisées au sein du SI ? Nous présenterons notamment une solution que nous avons mise en place pour utiliser la blockchain comme solution d'échangesentre des microservices déployés chez les différents acteurs d'une même plateforme.\nAu travers d'un autre cas d'utilisation, nous présenterons le standard Chainpoint et la plateforme Tierion, et comment nous l'avons utilisé pour faire de la notarisation d'information.\nEnfin, un retour d'expérience sur les problématiques de gestion d'identité sur les blockchains publiques et sur les points d'attention pour la sécurité des applications : Comment peut-on identifier un utilisateur ? Quels sont les standards émergents ? Nous vous présenterons une solution que nous sommes en train d'implémenter pour sécuriser l'accès à un portefeuille sur la blockchain basée sur la norme FIDO.\nEn résumé, nous vous proposons un aperçu assez complet sur ces technologies : les grands principes et concepts, les problématiques courantes, et quelques applications que nous avons déployées en production. Tout ça dans la joie et la bonne humeur :-)",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Applications réactives avec Eclipse Vert.x",
    "date": "2018-04-25T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/249581959/",
    "description": "Vert.x est un toolkit pour écrire des applications réactives et polyglottes pour la JVM. Il fournit aujourd'hui un écosystème complet et modulaire qui intègre le paradigme réactif de bout en bout, performant et facile à utiliser pour tous types d'applications. La richesse de l'écosystème Vert.x permet de développer aussi bien une application web de type temps réel, de faire de l'IoT, d'implémenter des adaptateurs de protocoles, d'écrire des applications distribuées et bien entendu de concevoir et intégrer des micro-services.\nCette session débutera avec une présentation générale à Vert.x et au Réactif puis enchaînera sur une introduction à la programmation réactive avec RxJava 2 et Vert.x\nPlus d'informations, sur le site du JUG (http://www.bordeauxjug.org/)",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Boîte à outils mémoire de la JVM ...",
    "date": "2018-03-29T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/248955519/",
    "description": "Vous vous êtes peut-être retrouvés dans cette situation : votre JVM se met à faire des GC à toute allure, Out Of Memory Error ! Que s'est-il passé ? Comment s'y prendre pour mener l'enquête ?\nNous commencerons par exposer la problématique. Nous allons voir comment la JVM utilise la mémoire et présenter différentes possibilités de dysfonctionnement. Ensuite, nous allons commencer à utiliser une boîte à outils mémoire pour diagnostiquer ce qui se passe dans notre JVM malade. Le fil conducteur sera principalement l'investigation de soucis de mémoire d'une application.\nDifférents outils seront présentés : lignes de commande, GC Viewer, Java Mission Control, Memory Analyzer Tool, JOverflow et quelques autres.\nPlus d'informations, sur le site du JUG (http://www.bordeauxjug.org/)",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Mettez à profit toutes les fonctionnalités de Kubernetes pour vos microservices",
    "date": "2018-02-15T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/247490956/",
    "description": "Cette conférence présentera un retour d'expérience sur le développement et le déploiement de microservices dans Kubernetes (démo avec GCP ou Azure).\nAprès un rapide rappel sur les microservices et les possibilités de Spring Boot + Spring Cloud, nous verrons les bases de Kubernetes et comment tirer partie de ses fonctionnalités natives (Labels, Services, Ingress, ConfigMap, Secret, ...)\nL'intérêt est de pouvoir déployer des microservices de technologies hétérogènes, non limitées à Java / Spring.\nQuelques slides et beaucoup de démos au programme !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Soirée Gilded-Rose ",
    "date": "2018-01-18T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/246724353/",
    "description": "L'auberge de Gilded-Rose est situé au cœur de Hurlevent, et propose aux voyageurs de tout Azeroth des armes rares, et des mets délicats.Leur système informatique de gestion des stocks et de prix est OK, il a été codé il y a 10 ans par un gnome stagiaire, qui est depuis passé sous un troll.Le code fonctionne. Par contre le code est très très moche, y amener le moindre changement est compliqué, les tentatives d'évolutions ont entrainé des régressions critiques pour l'économie de l'auberge et se sont toutes faites dans la douleur.\nVotre quête, si vous l'acceptez est\n- d'identifier les différents code smells- de refactorer le code pour le rendre modulable, testable, en restant iso-fonctionnel.- de rajouter des nouveaux objets à l'inventaire Le speaker : Fabien Lamarque alias @Fabinout\n´ Les technos : Java 8 (beaucoup), AssertJ (un peu), et IntelliJ IDEA.\nLe déroulé du live coding :- Présentation du contexte métier- Parcours du code- Écriture du test end-to-end de l'application\n... Et c'est parti",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "AG 2017",
    "date": "2017-12-14T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/245811130/",
    "description": "Jeudi 14 Décembre à 19h00 à l'Alcala (Talence), se tiendra l'Assemblée Générale ordinaire du Bordeaux JUG.\nCe sera l'occasion pour l'équipe de faire une rétrospective sur l'année passée ainsi que d'élire un nouveau bureau, tout cela autour d'un bon buffet (évidemment !).\nNous rappelons que l'AG est ouverte à tous. Par contre, seules les personnes ayant fait un don ou ayant souscrit au BordeauxJUG cette année pourront prendre part aux votes, et notamment à l'élection du futur bureau.\nN'hésitez donc pas à verser votre obole sur http://bordeauxjug.org/asso avant l'AG pour pouvoir voter !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "Alcala",
      "address": "Place Alcala de Henares, 33400",
      "city": "Talence",
      "country": "France"
    },
    "location": "Place Alcala de Henares, 33400, Talence"
  },
  {
    "title": "Modernisez vos API, passez à GraphQL!",
    "date": "2017-12-07T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/245214238/",
    "description": "Cédric Dué viendra nous présenter Jeudi 07 novembre à l'ENSEIRB : Modernisez vos API, Passez à GraphQL !\nAu cours de cette session, nous comparerons le style d'architecture REST à GraphQL avant d'appréhender les fondatmentaux de ce dernier.L'implémentation d'une API GraphQL en Java nous permettra d'illustrer les notions évoquées.Non Javaiste ? N'hésitez pas à venir, vous ne serez pas en \"REST\", GraphQL est indépendant du langage....\nLightning Talk : Frédéric Denis viendra nous présenter la programmation orientée objet sur Arduino.\nPlus d'informations sur le site du JUG",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Clean Code – Comment coder propre",
    "date": "2017-11-16T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/244964590/",
    "description": "Xavier Blanc viendra nous présenter Jeudi 16 novembre à l'ENSEIRB : Clean Code - Comment coder propre\nLe Clean Code est un ensemble de bonnes pratiques permettant de coder proprement quel que soit le langage de programmation. Le Clean Code répond aux questions de base du développeur et pose les bases d'une programmation efficace et utile.\nEn effet, si on code pour répondre uniquement aux besoins exprimés dans le cahier des charges, alors on aboutit inexorablement à écrire du code de mauvaise qualité, difficilement debuggable et maintenable. Une application mal codée convient pour un temps à ses utilisateurs, mais à terme, elle est condamnée à ne pas pouvoir évoluer. Coder proprement c'est produire un code lisible, efficace et facilement modifiable. Une application avec un code propre peut évoluer rapidement et ainsi satisfaire ses utilisateurs sur le long terme.\nPlus d'informations sur le site",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Serverless avec AWS Lambda ?",
    "date": "2017-10-12T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/243960460/",
    "description": "Jérémy Pinsolle et Gérôme Egron, viendront nous présenter Jeudi 12 octobre à l'ENSEIRB :\n Que se cache-t-il derrière les buzz words \"serverless\" et \"services managés\" ?Est-il réellement possible de constuire une application sans provisionner de serveur ?\nC'est ce que nous allons vous montrer à travers ce live coding.En partant d'une application existante, nous développerons pas à pas une nouvelle fonctionnalité à base de Lambda, de NoSQL (DynamoDB) et d'API Gateway pour enfin la déployer dans le cloud AWS.\nSi vous vous demandez comment coder une applicationrobuste, testée, scalable en vous concentrant sur lesfonctionnalités et non l'infrastructure, cette conférenceest faite pour vous :)\nPlus d'informations sur le site",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Préparez vous à la modularité selon Java 9 par Alexis Hassler",
    "date": "2017-09-13T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/243122966/",
    "description": "Alexis Hassler, viendra nous présenter Mercredi 13 septembre à l'ENSEIRB :\n En 2009, la mort du classpath a été annoncée. Il devait être remplacé par un système modulaire et tous nos problèmes de dépendance et de sécurité devaient se résoudre d'eux-mêmes. Le projet jigsaw sera finalement intégré au JDK 9 dont la sortie est prévue pour septembre 2017.\nLa modularité se retrouve à la fois dans le JDK et nos applications. Nous étudierons comment la modularité se retrouve dans le JDK et nos applications. Nous verrons quels problèmes ça résout et quels nouveaux problèmes ça pose. \nIl va falloir penser différemment les dépendances et l'encapsulation, préparons-nous.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "JUG OFF",
    "date": "2017-07-06T21:30:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/241343292/",
    "description": "Il s'agit de se retrouver autour du'une table pour discuter  du monde JAVA notamment de la session qui aura eu lieu juste avant, et de faire un point sur le BdxJUG donc n'hésitez pas à venir.\nAttention afin de pouvoir réserver, la limite des inscriptions est à 14hne vous inscriver que si vous compter venir.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "Alcala",
      "address": "Place Alcala de Henares, 33400",
      "city": "Talence",
      "country": "France"
    },
    "location": "Place Alcala de Henares, 33400, Talence"
  },
  {
    "title": "Raspberry Pi with Java 9 (au LABRI)",
    "date": "2017-07-06T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/241198031/",
    "description": "Jeudi 06 Juillet 2017 à 19h00 au LABRI, Stephen Chin vient nous parler de Raspberry PI avec Java9.\nThis presentation is designed to help you use your Java programming skills to create hobby projects using the Raspberry Pi as an inexpensive (35 USD) interface to the physical world. We will teach the concepts by demonstrating examples with working projects and source code. Some of the topics we will cover include:\n•  Unboxing your Raspberry Pi and setting up Java\n• Using Pi4J to program common I2C devices\n• Creating visual and touch UIs\n• Controlling 3D printers and CNC routers\n• Using Java 9 modules to shrink your app size\n• Connecting to the Internet of Things (IoT)\nComing out of this session you will have the knowledge you need to start building your own embedded projects for your home or office, and can leverage your Java programming skills to connect it to the IoT Cloud. Start building the future now with Java 9 Embedded technology!\nLa conférence sera en anglais.\nPlus d'informations sur le site du JUG.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "LABRI",
      "address": "Domaine universitaire, 351, cours de la Libération, 33405 Talence",
      "city": "Talence",
      "country": "France"
    },
    "location": "Domaine universitaire, 351, cours de la Libération, 33405 Talence, Talence"
  },
  {
    "title": "DDD, P&A, ES, CQRS, ETC",
    "date": "2017-06-22T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/240754591/",
    "description": "Jeudi 22 Juin 2017 à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Arnaud Bailly et Cédric Pineau viennent nous parler de DDD, P&A, ES, CQRS, ETC !\nParce que nous sommes tous des « fashion victims », parce que vous savez déjà que vous ne saurez pas résister aux sirènes des micro-services, parce vous peinez déjà à justifier l'approche « full reactive » dont vous rêvez pour ce projet qui doit démarrer, nous vous proposons de prendre un peu de recul et de discuter, pour une fois, d'architecture logicielle (et de moissonner au passage quelques nouvelles munitions pour votre prochaine « buzzword battle »).\nLe « Domain-Driven Design » est un cadre conceptuel pour le développement de logiciels qui met l'accent sur l'expression directe des concepts du métier sous forme de code, dans le but de diminuer la friction entre experts métiers et informaticiens.\nL'architecture « Ports And Adapters » est une démarche de structuration du code qui vise à isoler la logique métier des détails techniques de son implémentation.\n« Event Sourcing » désigne un principe d'architecture, décrit par Martin Fowler, qui met au centre du monde les événements transformant l'état d'un système. L'état n'est alors rien d'autre que la suite des événements l'ayant produit à partir d'un état initial connu et précisément défini.\nLe principe de « Command Query Responsibility Separation » ou CQRS est un prolongement naturel de l'Event Sourcing où l'on introduit une séparation complète des schémas de données en écriture et en lecture.\nCette présentation est un retour sur nos expériences dans la mise en œuvre de systèmes logiciels basés sur ces démarches de conception et d'architecture. Nous voulons montrer quels sont les principes de ces architectures, quels en sont les avantages tant techniques que métiers dans des cas d'utilisation concrets et comment les mettre en œuvre quels que soient les environnements techniques.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Stream Processing avec Apache Flink",
    "date": "2017-06-08T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/240460871/",
    "description": "Jeudi 08 Juin 2017 à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Tugdual Grall vient nous parler de Stream Processing avec Apache Flink\nLes données sont au coeur de nos applications, et sont créées de façon continue sous forme de flux (stream). L'architecture orientée flux (Streaming Architecture) permet de réduire la latence entre l'émission d'un évènement et les décisions à prendre en fonction des évènements passés et en cours, tout en gardant une architecture globale simple et efficace. Apache Flink est un framework permettant de créer des application orientées flux, avec:\n•  Le temps réel débarque en force: du big data au fast data\n• Les entreprises sont nombreuses a créer de nouvelles applications et services autour du big data. Après avoir fait un tour d'horizon des cas d'usages du big data, nous verrons qu'aujourd'hui les nouvelles applications doivent traiter un volume et une diversité de données toujours plus important; cela implique un changement au niveau des technologies a mettre en place.\n• En s'appuyant sur les cas d'usages, par exemple la détection de fraude, l'IoT, nous discuterons des solutions techniques à mettre en place, et leur impact sur l'architecture des nouvelles applications. (Gestion des Graphes de données. DB, Cascading, Elasticsearch)\nLe tout déployé de façon distribuée et hautement disponible.\nCette présentation est l'occasion de découvrir Flink, son coeur, ses APIs et l'approche \"streaming first\" pour vos applications.\nFlink est utilisé en production par de nombreuses entreprises:Bouygues Telecom, Netflix, Alibaba, Ericsson, King, Zalando, et bien d'autres, supporté par la société Data Artisans et une communauté de plus de 140 contributeurs.\nPlus d'informations sur l'annonce du site du JUG.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Ingest Node : (Ré)indexer et enrichir des documents dans ElasticSearch",
    "date": "2017-05-04T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/239283917/",
    "description": "Jeudi 04 Mai 2017 à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, David Pilato vient nous parler de Ingest Node :  (Ré)indexer et enrichir des documents dans ElasticSearch ! \nLorsque vous injectez des données dans elasticsearch, vous pouvez avoir besoin de réaliser des opérations de transformation assez simples. Jusqu'à présent, ces opérations devaient s'effectuer en dehors d'elasticsearch, avant l'indexation proprement dite.\nSouhaitez la bienvenue à Ingest node ! Un nouveau type de noeud qui vous permet justement de faire cela.\nCe talk explique le concept de Ingest Node, comment l'intégrer avec le reste de la suite logicielle Elastic et comment développer son propre plugin Ingest par la pratique en montrant comment j'ai développé le plugin ingest-bano pour enrichir des adresses postales et/ou des coordonnées géographiques françaises (pour l'instant).\nCe talk parlera également de l'API de réindexation qui peut également bénéficier du pipeline d'ingestion pour modifier vos données à la volée lors de la réindexation.\n.\nPlus d'informations sur le site du JUG",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Living documentation, ou comment faire de la documentation sans l'écrire.",
    "date": "2017-04-13T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/238993162/",
    "description": "Jeudi 13 Avril 2017 à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Olivier Revial et Romain de Oliveira vient nous parler de  Living documentation ! \nS'il y a bien une chose que l'on déteste en tant que développeur, c'est d'écrire des pages et des pages de documentation, qui ne sont jamais à jour, que personne ne lit, qui ne sont pas pratiques à utiliser, etc.\nEt si la documentation n'était pas une fatalité ?\nEt si, soyons fous, fournir des exemples d'utilisation d'une API REST était aussi simple que d'écrire un test unitaire ?\nA travers un live coding, nous verrons comment nous pouvons simplifier notre vie de développeur pour tout ce qui touche à la documentation : en gros, générer le plus possible en écrivant le moins possible !Nous coderons donc un microservice SpringBoot et nous essaierons d'avoir une \"living documentation\", qui soit une documentation vivante et capable d'évoluer automatiquement lorsque le code évolue.\nPlus d'informations sur le site du JUG",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "TypeScript : dès lundi sur votre App Legacy",
    "date": "2017-03-23T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/238356406/",
    "description": "Jeudi 23 Mars 2017 à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, en début de soirée nous vous proposons des nouvelles du monde Java, suivi d'un quickie  \"Framework JS, l'alternative : Aurelia\" proposé par Bruno Lacombe.\nPuis Frédéric Camblor viendra nous parler de Typescript sur nos applications Front !\nL'abstract :\nAvez-vous déjà développé une App Front de 5K+ lignes de JS ? Ne vous êtes-vous jamais senti perdu lorsque vous êtes revenus sur votre propre code sans connaître la structure et les méthodes des objets que vous manipuliez ?.. Et ne parlons même pas du code écrit par vos collègues !\nTypeScript (TS) et son typage statique peut vous aider à passer moins de temps à debugger dans votre browser en codant de manière type-safe ! Et bonne nouvelle : vous n'avez pas besoin de démarrer un projet from scratch sous Angular 2 pour commencer à l'utiliser !\nCe talk sera 100% livecoding et montrera une mise en place progressive de TypeScript sur un projet legacy écrit en JS.\nNous verrons :\n• Comment mettre en place la compilation TS en tâche de fond sur le projet, faire cohabiter les fichiers TS avec les fichiers JS ainsi que comprendre le code généré\n• L'interopérabilité avec les librairies JS non écrites en TS via l'outillage typings\n• Enfin, nous migrerons du code JS en TS pour identifier les bienfaits apportés par le langage : types (classes/interfaces), modules, closures, immutabilité, paramètres optionnels, union types, complétion, doc implicite",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Functional web applications with Kotlin and Spring 5",
    "date": "2017-01-12T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/236351273/",
    "description": "Jeudi 12 janvier 2017 à 19h00 dans l'amphi C de l'ENSEIRB MATMECA, Sébastien Deleuze vient nous parler de  \"Functional web applications with Kotlin and Spring 5\" !\nCette présentation a pour but de vous montrer un nouveau type d'application fonctionnelle utilisant Spring Reactive ainsi que le langage Kotlin qui convient tout aussi bien à la programmation orientée objet qu'à la programmation fonctionnelle.\nJe me baserai sur un exemple concret, en l'occurence le projet du nouveau site de la conférence Mix-IT dont je m'occupe et dont les sources sont disponibles sur https://github.com/mix-it/mixit/:- Le support Kotlin intégré à Spring Framework 5 (en exclusivité mondiale ^^)- Le nouveau framework Spring Web functional- L'API de récupération de bean basée sur les lambdas (plus de proxy CGLIB)- Des classes immutables et une injection par constructeur plutôt que par setter- La puissance des extensions Kotlin pour un code propre- Un rendu des template client et server avec Mustache- Une application légère et Reactive basée sur Reactor Netty- L'utilisation de MongoDB via une API Reactive- Un fichier de build Gradle écrit également en Kotlin\nCe talk est accessible à tout java-iste et même si vous ne connaissez pas Kotlin. Ca vous tente ?",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "\"Plateforme dynamique, #docker #dns #scalabilité... Où sont mes microservices ?\"",
    "date": "2016-12-15T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/235866651/",
    "description": "Jeudi 15 décembre 2016 à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Jérémie MONSINJON et Florian GARCIA nous parleront de \"Plateforme dynamique, où sont mes microservices ?\"\nVous ne pouvez pas être passés à côté de la \"tendance\" des \"microservices\". Sur le papier, rien à dire, mais concrètement, beaucoup de mystères planent encore au dessus de ce concept.Comment les services communiquent-ils ? Le \"discovery\", kézako ? Et si on \"scale\", ça casse tout ? J'ai entendu parler de Docker, ça me sert à quoi dans mon architecture ?\nSi, vous aussi, vous avez déjà eu besoin de mettre en place des mécanismes \"custom\" et \"statiques\" d'enregistrement et de découverte de services, ou que vous souhaitez commencer, ce talk est fait pour vous !Nous vous proposerons, au travers d'exemples concrets (pour ne pas dire \"live coding\"), de comprendre comment fonctionnent les mécanismes d'enregistrement et de découverte de microservices sur une plateforme de plus en plus dynamique avec les outils Docker (Network, Docker-Compose, Swarmkit, ...)",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "AG 2016",
    "date": "2016-12-07T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/235866508/",
    "description": "Mercredi 7 Décembre à 19h00 à l'ENSEIRB MATMECA (1er etage en face de la salle MSIO), se tiendra l'Assemblée Générale ordinaire du Bordeaux JUG.\nCe sera l'occasion pour l'équipe de faire une rétrospective sur l'année passée ainsi que d'élire un nouveau bureau, tout cela autour d'un bon buffet (évidemment !).\nNous rappelons que l'AG est ouverte à tous. Par contre, seules les personnes ayant fait un don ou ayant souscrit au BordeauxJUG cette année pourront prendre part aux votes, et notamment à l'élection du futur bureau.\nN'hésitez donc pas à verser votre obole sur http://bordeauxjug.org/asso avant l'AG pour pouvoir voter !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "SonarLint et SonarQube pour détecter les bugs, code smells et vulnérabilités",
    "date": "2016-11-17T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/235485040/",
    "description": "Jeudi 17 novembre 2016 à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Freddy Mallet nous parlera de SonarLint, et SonarQube.\nDurant cette présentation, Freddy montrera comment totalement intégrer SonarLint et SonarQube dans une chaine de développement pour détecter en continue les problèmes de fiabilité, maintenabilité et sécurité. La présentation s'appuiera sur des exemples de code source Java, JavaScript, C# et C.\nPlus d'informations sur le site du JUG",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Java EE, Micro Profile, TypeScript et Angular 2",
    "date": "2016-10-27T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/234702577/",
    "description": "Jeudi 27 octobre à 19h00 dans l'Amphi D de l'ENSEIRB MATMECA, Antonio Goncalves et Sébastien Pertus nous parleront de JavaEE, Micro Profile, TypeScript et Angular 2 !\nAntonio est un développeur Java et ne connait rien en interface utilisateur. Il utilise son Mac pour développer des micro-services Java EE, les exécute avec WildFly Swarm, les package dans du Docker et expose de belles interfaces REST dans le Cloud.\nSébastien est un développeur TypeScript et ne connait rien à Java. Employé de Microsoft, il utilise son PC pour développer des belles interfaces utilisateur avec TypeScript et Angular2 pour invoquer les services REST exposés par Antonio.\nCette conférence est destinée aux développeurs Java qui souhaitent découvrir comment utiliser un front-end Angular2/TypeScript avec un back-end Java/MicroProfile. Elle est composée de trois parties. \n1) Présentation du Micro Profile Java EE et utilisation de WildFly Swarm. \n2) Découvrir le language TypeScript. \n3) Créer une interface Angular2 interagissant avec un back-end REST.\nVenez à cette conférence. Vous verrez beaucoup de code et de belles démos s'exécutant sur un Mac, un Windows .... et dans le Cloud!\nhttps://lh3.googleusercontent.com/GOpJJ3lEsTBBaQWZSiYNM1RJL9k9viBrV18AjgGh2Y7V1TO6d_-_TlKDfXGOBSIUwredEsq_PpuI0A=w1440-h900-rw-no",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Ionic, un framework mobile hybride fun et addictif",
    "date": "2016-09-22T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/233895791/",
    "description": "Créer des applications mobiles est un truc fun mais lorsqu'on vous demande de développer ces mêmes applications pour Android et  iOS, vous vous dites \"au secours, il faut tout refaire!\". Une solution est disponible : Ionic.\nIonic est un framework qui s'appuie sur la stack de développement web (HTML5, CSS3, Javascript, AngularJS) et qui permet de développer des applications mobiles hybrides pour les plateformes Android et iOS. Ionic s'appuie aussi sur Cordova pour accéder aux éléments disponibles sur les devices comme le GPS ou la caméra. On peut alors avoir envie de développer des applications encore plus fun mêlant la position GPS et la caméra ou développer sa propre version de Pokemon GO!\nVenez découvrir comment créer des applications mobiles hybrides avec Ionic et découvrir le futur d'Ionic avec la version 2 s'appuyant sur Angular 2.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Bordeaux JUG Off 2016",
    "date": "2016-07-05T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/232348696/",
    "description": "Comme chaque année nous organisons une petite rencontre informelle entre juggers bordelais autour d'un verre et d'un repas.\nMardi 5 Juillet, venez nous rejoindre afin de discuter : développement java, web, cloud, jug.\nMerci de vous inscrire si vous venez pour que l'on ait une idée du nombre de tables à prévoir.\nA bientôt!",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "The Connemara",
      "address": "14-18 Cours Albret",
      "city": "Bordeaux",
      "country": "France"
    },
    "location": "14-18 Cours Albret, Bordeaux"
  },
  {
    "title": "Eclipse Che: the Next-Gen Eclipse IDE",
    "date": "2016-06-09T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/231401974/",
    "description": "Jeudi 9 juin à 19h00 dans l'Amphi A de l'ENSEIRB MATMECA, Florent Benoit et Stévan Le Meur présenteront Eclipse Che: the Next-Gen Eclipse IDE\nEclipse Che est à la fois un serveur de workspaces développeur et un IDE cloud.\nChe peut être installé de la même façon qu'un IDE classique pour n'importe quel type de framework ou de langage. Chaque workspace est composé de projets et d'un environnement qui fournit l'ensemble des composants nécessaire à leur développement ainsi qu'à leur exécution. Un environnement est défini par un ensemble de machines Docker qui sont directement utilisées par Che.\nDurant cette session, nous présenterons le projet Eclipse Che, son architecture ainsi que la notion de workspace portable. Nous montrerons également comment utiliser Che pour développer des applications Java ainsi que la plupart des fonctionnalités de l'IDE (debugger, java refactoring). Nous terminerons par l'introduction du plugin DevOps qui permet d'intégrer Che dans vos workflows de continuous delivery.\nVenez nombreux",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Hawkular Powers: Le Dev au pistolet d'Ops",
    "date": "2016-05-12T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/230822572/",
    "description": "Jeudi 12 mai à 19h00 dans l'Amphi A de l'ENSEIRB MATMECA, Thomas Segismont présentera Hawkular Powers: Le Dev au pistolet d'Ops\nNous fabriquons des applications de plus en plus complexes,déployées sur site ou dans le cloud. Et les utilisateurs veulentsavoir si elles fonctionnent avec des informations qu'ilscomprennent,liées au métier. Comment collecter, enregistrer et restituer cesinformations ?\nCette présentation vous fera découvrir Hawkular, un outil demonitoring pour les ops et les devs. Vous apprendrez commentdémarrervotre serveur, surveiller votre environnement, et intégrer lesoutilsMetrics*, Charts et Alerts directement dans votre application.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "JIGSAW notre sauveur",
    "date": "2016-04-12T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/230045752/",
    "description": "Mardi 12 avril à 19h00 dans l'Amphi A de l'ENSEIRB MATMECA, Rémi Forax, le plombier national de la jvm viendra nous présenter la fonctionnalité tant attendu de Java 9 : JIGSAW notre sauveur\n jigsaw est là pour nous sauver : \n• pourquoi on se retrouve avec des bibilothèques de plusieurs mégas en Java ? \n• pourquoi mon application est lente au démarrage ? \n• pourquoi mon appli qui tourne depuis 15 jours vient de planter avec un NoClassDefFound ? \n•  pourquoi la moitié des fix de sécurité de Java ont un CVSS de 10 ? \nEn vérité mes fréres, je vous le dit, jigsaw est là pour vous sauvez, pour nous sauvez, entrez dans mon eglise, voyez la lumière, venez apprendre la parole de jigsaw notre sauveur.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "De Zéro à Héros avec Spring Boot",
    "date": "2016-03-31T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/229566440/",
    "description": "Jeudi 31 mars 2016 à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Stéphane NICOLL<a href=\"http://www.bordeauxjug.org/speakers#mathieuancelin\"></a>, viendra nous présenter Spring Boot.\nSpring Boot, the new convention-over-configuration centric framework from the Spring team at Pivotal, marries Spring's flexibility with conventional, common sense defaults to make application development move swiftly and enjoyable.\nIt's ideally suited for building microservices and distributed systems and makes streamlining devops practices simple.\nJoin Spring Boot committer Stéphane Nicoll for a look at what Spring Boot is, why it's turning heads, why you should consider it for your next application (REST, web, batch, big-data, integration, whatever!) and how to get started.!",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Let's React",
    "date": "2016-02-10T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/228464263/",
    "description": "Mercredi 10 Février 2016 à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Mathieu Ancelin, viendra nous présenter ReactJS.\nLet's React : React est une librairie JavaScript développée par Facebook pour créer facilement des interfaces graphiques. La particularité de React vient de son modèle de programmation orienté composant et de sa façon de décrire les vues de ces composants. Contrairement à d'autres librairies, ici pas de templates et de pseudo code, React permet d'utiliser la pleine expressivité de JavaScript et de bénéficier de tout l'écosystème Javascript et de toutes les features du langage, notamment tous les goodies apportés par ES2015.\nDurant cette session orientée live coding, nous verrons comment utiliser React pour créer des composants graphiques dans le cadre d'applications web et d'applications mobiles natives grâce à React Native.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Quickie Party",
    "date": "2016-01-21T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/228184140/",
    "description": "La soirée sera composée par trois quickies :\nOlivier CROISIER sur les logs\nFrameworks de logs, des problèmes qu'ils ont résolu (ou pas), et des perspectives futures\nBruno LACOMBE\nLive coding du genre : \"convertir\" sa web application en un exécutable avec Java FX et son composant webview\nBenoit PRIOUX sur les microservices\nAujourd’hui, les architectures microservices sont des patterns de plus en plus utilisés. Elles s’opposent aux architectures monolithiques, qu’on associe souvent aux technologies JavaEE. Durant trente minutes, je vais essayer de vous convaincre que JavaEE est tout à fait adapté aux microservices et même aux picoservices !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "AG 2015",
    "date": "2015-12-15T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/227402106/",
    "description": "Mardi 15 Décembre à 19h00 à l'ENSEIRB MATMECA (1er etage en face de la salle MSIO), se tiendra l'Assemblée Générale ordinaire du Bordeaux JUG.\nCe sera l'occasion pour l'équipe de faire une rétrospective sur l'année passée ainsi que d'élire un nouveau bureau, tout cela autour d'un bon buffet (évidemment !).\nNous rappelons que l'AG est ouverte à tous. Par contre, seules les personnes ayant fait un don ou ayant souscrit au BordeauxJUG cette année pourront prendre part aux votes, et notamment à l'élection du futur bureau.\nN'hésitez donc pas à verser votre obole sur http://bordeauxjug.org/asso avant l'AG pour pouvoir voter !\nL'AG se conclura par un buffet aux alentours de 20h15.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Intégration Spark/Cassandra, théorie et pratique",
    "date": "2015-12-10T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/227072081/",
    "description": "Jeudi 10 décembre à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Duy Hai DOAN</a> viendra nous parler d'intégration de <a href=\"http://bordeauxjug.org/20151210_Integration_SparkCassandra\">Spark/Cassandra, Etudes et pratiques\nCassandra est une base de données NoSQL reconnue pour sa scalabilité linéaire et sa très haute disponibilité. Cette présentation abordera son architecture, ses caractéristiques mais aussi son modèle de données orienté colonnes et son langage CQL.\nApache Spark est un framework de traitement de données Big Data généraliste qui permet de faire bien plus que du Map-Reduce (mais pas seulement), avec une API très accessible et d'excellentes performances.\nEn combinant l'API flexible de Spark avec les performances de Cassandra, nous avons une alternative technique intéressante par rapport à l'éco-système classique Hadoop, que ce soit pour les traitements temps-réel ou du batch.\nLes deux outils donneront l'occasion d'illustrer quelques patterns d'utilisation avec des démos en live.\nVenez nombreux.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Machine Learning avec Spark",
    "date": "2015-11-19T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/226638295/",
    "description": "Jeudi 22 octobre à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Zhe Li viendra nous parler de Machine learning avec Spark\nDe manière plus globale, le machine learning est un nouveau buzzword. L'exploitation des données semble être devenu un nouvel enjeu pour les boîtes. Et Spark, un outil permettant de faire du traitement de larges volumes de données d'une manière distribuée est en train de remplacer Hadoop à grande vitesse.\nPendant ce talk, je vais vous montrer la base de machine learning, l'écosystem de Spark et quelques use cases\nL'objectif est de démontrer l'adaptation et l'élégance d'implémentation de certains algorithmes de Machine Learning en utilisant ce framework Spark.\nDe son coté, Nicolas Comet animera le début de la soirée avec du Live Coding : génération bytecode JVM runtime avec ByteBuddy, même pas peur !\" \nVenez nombreux",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Continuous Delivery avec Jenkins et Docker",
    "date": "2015-10-22T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/226039925/",
    "description": "Jeudi 22 octobre à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Nicolas de Loof viendra nous présenter une session sur Jenkins Workflow. \nle \"Continuous Delivery\" est un sacré buzz word, et \"Docker\" encore plus, mais les blog que j'ai pu lire sur sujet ne proposent qu'un pipelines naif et minimaliste : compile, test, push docker image, et voilà.\nEn 2015 Jenkins adresse clairement plus que de l'Integration Continue, et avec le support récent du workflow plugin nous pouvons orchestrer avec un DSL des pipelines de grande complexité.\nL'integration avec Docker lui donne encore plus de puissance.\nPendant cette session, je vais construire avec vous un pipeline de CD pour montrer l'utilisation du workflow et sa flexibilité, ainsi quele support de Docker.\nVenez nombreux",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Asciidoctor RTFM",
    "date": "2015-09-24T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/225140026/",
    "description": "Jeudi 24 septembre à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Benoit Prioux viendra nous présenter une session sur Asciidoctor.\nÉcrire de la documentation est souvent une tâche pénible pour les développeurs... Ils préfèrent coder !\nPourtant, il existe des solutions comme Asciidoc, une syntaxe qui réconcilie les développeurs avec la documentation. Asciidoctor est un projet open-source, qui propose processeur pour convertir un document Asciidoc en HTML, DocBook,...\nMais Asciidoctor ce n'est pas qu'un projet, c'est une communauté ! \nDurant cette session, je vous propose de faire le tour de tout l'éco-système Asciidoctor :\n• le processeur en Ruby\n•  l'intégration avec le monde Java\n• l'intégration avec vos outils de build (Maven,Gradle,Ant)\n•  l'intégration avec Javascript et le web\n• ses extensions",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Jug Off 2015",
    "date": "2015-07-08T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/223699329/",
    "description": "Comme chaque année nous organisons une petite rencontre informelle entre juggers bordelais autour d'un verre et d'un repas.\nMercredi 8 Juillet, venez nous rejoindre afin de discuter : développement java, web, cloud,  jug.\nMerci de vous inscrire si vous venez pour que l'on ait une idée du nombre de tables à prévoir.\nA bientôt!",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "The Connemara",
      "address": "14-18 Cours Albret",
      "city": "Bordeaux",
      "country": "France"
    },
    "location": "14-18 Cours Albret, Bordeaux"
  },
  {
    "title": "Hibernate OGM : ORM et NoSQL sont-ils solubles?",
    "date": "2015-06-17T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/222982961/",
    "description": "Mercredi 17 juin à 19h00 dans l'amphi D de l'ENSEIRB MATMECA, Emmanuel Bernard viendra nous présenter une session sur Hibernate OGM.\nOn n'est pas que des cobayes: ORM et NoSQL sont-ils solubles?\nVous voulez savoir ce que la persistance dans du NoSQL implique dans une architecture Java?\nJava est le fief de l'Orienté Objet où les ORMs poussent comme des champignons. Est-ce que les ORMs apportent encore des bénéfices dans le monde du NoSQL et de la persistance polyglotte? On discutera aussi le pourquoi et le comment du design de données dans le NoSQL.\nComme dans l'émission, \"On n'est pas que des cobayes\", on tentera de faire cohabiter ORMs et NoSQL en y analysant le résultat.\nParmi les défis relevés, on pourra y voir:\n* Peut on survivre avec un seul produit NoSQL ?\n* NoSQL implique-t-il des cauchemardas de duplications de données?\n* JPA et NoSQL c'est comme faire rentrer une pièce ronde dans un trou carré?\n* Les ORMs ne peuvent pas abstraire proprement les modèles de données NoSQL?\n* Les ORMs c'est comme la nitro, ça booste les performances... ou pas?\n* Abstraire les langages de requêtage NoSQL, c'est trop difficile?.\n* Sans l'accès natif aux APIs NoSQL, point de salut?\n* Les ORMs n'apportent pas vraiment de valeur dans un monde NoSQL?\nVenez discuter et débattre.\nHibernate BoF\nOn prendra le reste du temps pour discuter des autres projets Hibernate:\n- Qu’est-ce qu’Hibernate Search, quels sont les nouveautés?\n- Qu’est-ce qui se passe du côté d’Hibernate ORM?\n- Hibernate Validator, Bean Validation, quésako?\n...",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Convention over configuration: the Gradle Way",
    "date": "2015-05-05T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/222040907/",
    "description": "Mardi 5 mai à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Cédric Champeau viendra nous présenter une session sur Gradle.\nOn entend souvent dire que Gradle est un système de build impératif. \nS'il est correct de dire que Gradle permet de faire de l'impératif dans une build, ça n'est certainement pas le point clé. Au contraire, nous expliquerons comment Gradle hérite des bons aspects de Maven tout en généralisant le concept, et en vous offrant la possibilité de définir vos propres conventions, particulièrement utile en mode corporate. \nPlugins, tâches, séparation des aspects, wrapper, autant de concepts qui vous seront expliqués et vous aideront à bien démarrer et concevoir des builds idiomatiques, propres et bénéficiant des avantages d'un outil de build moderne.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "À la découverte de MongoDB 3.0 !",
    "date": "2015-04-16T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/221648599/",
    "description": "Pour cette session d'avril 2015, Tugdual nous propose :\nVenez Découvrir MongoDB 3.0!\nIl y a un mois la version 3.0 de MongoDB est sortie avec de nombreuses nouveautés:- Nouveau Moteur de Stockage : Wired Tiger- Automatisation des déploiement avec les outils MMS et OpsManager\nDurant cette présentation Tugdual présentera ces nouveautés et se fera un plaisir de répondre à toutes les questions de la communauté!\nVenez nombreux !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Soirée Cassandra avec Sébastien Augereau",
    "date": "2015-03-19T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/220850469/",
    "description": "NoSql, quoi !! encore ?Après que Laurent ait préparé le terrain en Septembre avec sa session sur la persistance polyglotte dans laquelle il avait présenté les différents type de base NoSql existants, je vais essayer d'entrer un peu plus dans le détail concernant l'une d'entre elle : Cassandra.\nCassandra c'est quoi ?\nTout le monde parle de MongoDb (surtout que MongoDB c'est pour le mois prochain), alors pourquoi nous parler de Cassandra ? Et  au final pour quoi l'utiliser ?\nAu programme :\n• Architecture de cassandra\n• Scalabilité et performance\n• Différence avec MongoDb\n• Anti-patterns\n…Une mise en oeuvre dans un contexte Twitter + storm + cassandra\nVenez nombreux !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Lucy in the cloud with Docker",
    "date": "2015-02-05T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/220124167/",
    "description": "Jeudi 5 Février à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, David Gageot viendra nous présenter une session sur Docker.\nLucy in the cloud with docker\nOn parle beaucoup de Docker en ce moment. Je vais tenter de vous expliquer comment fonctionne Dockercomme j'aurais aimé qu'on me l'explique.\nNous allons apprendre à prendre en main Docker pour packager une application web java 8,que nous déploierons sur la Google Cloud Platform en utilisant Compute Engine.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "LP4J, a song of Java, MIDI and websockets",
    "date": "2015-01-22T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/219792716/",
    "description": "Pour cette première session de 2015, Olivier Croisier vous propose une soirée amusante en quatre parties : \n- Découverte du Launchpad, ce drôle d'appareil à mi-chemin entre le clavier et la matrice de LEDs, utilisé par les plus grands DJ pour piloter leurs samplers et logiciels de musique ; \n- Présentation de l'API LP4J qui permet de le contrôler en Java ; \n- Etude de l'émulateur web temps réel, propulsé par VertX, les websockets et SVG ; \n- Réflexions autour de l'architecture et de la définition des API Venez nombreux !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Jeudi 11 décembre : AG du JUG",
    "date": "2014-12-11T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/218973416/",
    "description": "Jeudi 11 Décembre à 19h00 à l'ENSEIRB MATMECA (1er etage en face de la salle MSIO), se tiendra l'Assemblée Générale ordinaire du Bordeaux JUG.\nCe sera l'occasion pour l'équipe de faire une rétrospective sur l'année passée ainsi que d'élire un nouveau bureau, tout cela autours d'un bon buffet (évidemment !).\nLes personnes souhaitant présenter leur candidature pour une nomination au Bureau sont les bienvenues et pourront le faire dans le cadre de l'AG (n'hésitez pas à vous manifester avant en nous envoyant un mail à [masked]).\nNous rappelons que l'AG est ouverte à tous. Par contre, seules les personnes ayant fait un don ou ayant souscrit au BordeauxJUG cette année pourront prendre part aux votes, et notamment à l'élection du futur bureau.\nN'hésitez donc pas à verser votre obole sur http://bordeauxjug.org/asso avant l'AG pour pouvoir voter !\nNous attirons votre attention sur 2 sujets importants qui seront abordés durant cette AG, et qui nécessiteront votre vote :\n- Le renouvellement du bureau : une partie des membres du bureau actuel ne réitèreront pas leur mandat l'année prochaine. N'hésitez donc pas à venir nous donner un coup de main car sans ses bénévoles, le JUG n'existerait tout simplement pas !\n- Avec la création, cette année, de la conférence BDXIO portée par l'asso du BordeauxJUG, nous envisageons un split en 2 associations distinctes (pour différentes raisons : budgets séparées, équipes d'orga différentes, mode de fonctionnement différent). Nous organiserons un vote notamment pour valider que les comptes soient séparés et les bénéfices bdxio de cette année soient transférées à la nouvelle association.\nL'AG se conclura par un buffet aux alentours de 20h15.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Jeudi 4 Décembre : Soirée JHipster",
    "date": "2014-12-04T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/218765429/",
    "description": "Jeudi 4 Décembre à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Julien Dubois viendra nous présenter une session de Live coding sur JHipster.\nJHipster est un générateur d'applications AngularJS + Spring Boot, vous proposant un workflow performant pour développer une application moderne, performante, et agréable à utiliser! \nTrès populaire (+1100 étoiles Github), le projet est utilisé avec succès par une large communauté de développeurs, ce qui garantit la qualité du code généré. Cette session est une présentation rapide du projet (5 minutes de slides), pour ensuite voir concrètement le fonctionnement de JHipster, et comment travailler avec les outils auto-configurés (Maven, Grunt, Yeoman, Bower...). \nNous aurons du live-coding, des démos, des tests, des requêtes en base de données, des astuces de performance pour la production, et nous terminerons par un déploiement dans le cloud (si la connexion Internet nous le permet !)",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Introduction à Clojure et Live Coding",
    "date": "2014-11-13T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/218255602/",
    "description": "Jeudi 13 Novembre à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Jérôme Molière viendra nous donner une introduction à Clojure et sera assisté de Carl Azoury (PDG Zenika) pour un live coding.\nIntroduction Clojure\nPrésentation des bases du langage Clojure & justification du choix de Clojure comme langage.\n Cette présentation sera suivi d'un Live Coding avec Carl Azoury (PDG Zenika) : comment utiliser les sequences Clojure et la composition de fonctions dans un REPL (read–eval–print loop) ..",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "CDI Today... and Tomorow (A. Goncalves)",
    "date": "2014-10-23T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/213012482/",
    "description": "In this session Antonio will introduce Context & Dependency Injection, explain most of the concepts (injection, producers, interceptors, decorators, events...) but also show you why CDI has become the main specification of Java EE. As CDI 2.0 is in the starting block, Antonio, who is part of the expert group, will share with you the roadmap that the 2.0 version has in mind.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "La persistance polyglotte ou comment intégrer quatre moteurs de bases de données",
    "date": "2014-09-25T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/207221112/",
    "description": "NoSQL ! OUI d'accord on le sait, c'est un buzz word persistant et beaucoup de présentations ont été faites sur le sujet.\nLes cibles de déploiement de nos applications sont désormais dans le cloud, un autre buzz word encore plus f.meux, qui favorise le déploiement de services souvent accessibles en REST avec des besoins de stockage de données performants, distribués, accessibles. Mais, ...\nQuelles sont les fonctionnalités offertes par ces nouvelles bases de données ?Laquelle dois-je utiliser et pour quel besoin ? Si oui comment les utiliser ?Dois je pour ça dire NO au SQL ? Dois je abandonnner mon mapping Objet Relationnel, lequel j'ai mis tant de temps à appréhender les mécanismes ?\nDepuis quelque temps, je me pose toutes ces questions et me suis intéressé à quelques unes de ces bases NoSQL.J'ai donc mis gracieusement les mains dans le cambouis afin de voir comment un développeur Java peut mettre en oeuvre ces différents moteurs de base de données. Je vous propose donc au travers de cette session un petit retour sur mon investissement.Cette session prendra donc la forme d'un petit live coding entre amis et partira de quelques besoins proches de la réalité qui donneront l'occasion de mettre en oeuvre Redis, MongoDB, Neo4j, et finalement Solr ; tout cela orchestré par Spring Boot et Spring Data.\nFinalement, en ayant abordé ces quatre moteurs de bases de données avec des philosophies bien différentes, nous pourrons nous targuer d'un certain polyglottisme persistant.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Jug Off au Connemara",
    "date": "2014-07-07T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/192113902/",
    "description": "Comme chaque année nous organisons une petite rencontre informelle entre juggers bordelais autour d'un verre et d'un repas.\nLundi 7 Juillet (pas de match en vue!) venez vous joindre à nous pour discuter de dévelopement java, web, de cloud, de BDX.io et de tout autre chose que du foot.\nMerci de vous inscrire si vous venez pour que l'on ait une idée du nombre de tables à prévoir.\nA bientôt!",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "The Connemara",
      "address": "14-18 Cours Albret",
      "city": "Bordeaux",
      "country": "France"
    },
    "location": "14-18 Cours Albret, Bordeaux"
  },
  {
    "title": "Appliquer le Web aux données",
    "date": "2014-06-11T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/186439052/",
    "description": "Je veux permettre à mes utilisateurs d'intéragir avec mes données via une Web API. Ok, mais comment faire en pratique ? Après tout, je faisais déjà ça il y a 10 ans avec Web Services (et XML !). Et on savait tous à l'époque que c'était la bonne façon de faire :-) Mais maintenant, mon CTO me dit d'utiliser REST, et qu'Hypermedia doit être le moteur de mon application (cf. HATEOAS).\nAlors RESTful, juste un buzz ? Quel bénéfice pour mes utilisateurs ? Et pour mon équipe de développeurs ? Et comment s'y retrouver dans tous ces blogs et livres sur le sujet, parfois même contradictoires ?\nL'objectif de cette présentation : vous apprendre à naviguer par vous-mêmes dans tous ces concepts. Je ferai une revue de l'état de l'art, illustré par des exemples concrets et des conseils pratiques.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Des applications réactives avec Spring 4, AngularDart et Websocket",
    "date": "2014-05-22T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/182201392/",
    "description": "Cette conférence abordera le développement d’applications réactives via un retour d’expérience portant sur le projet OpenSnap, un clone HTML5 de SnapChat utilisant Java 8, Spring Boot, Spring Framework 4 et AngularDart.\nAu programme :\n• Pourquoi Spring Boot est une révolution !\n• Les nouveautés de Spring Framework 4 telles que le support de Websocket, SockJS et STOMP\n• L’efficacité de développement unique qu’apportent Dart et AngularDart côté client\n• Quelles différences entre le développement RIA avec des webservices REST et Websocket\n• Quelles fonctionnalités bénéficient de ces nouvelles possibilités de push du serveur vers le client\n• Pourquoi le support de SockJS permet de faire du « websocket » dans la vraie vie, y compris derrière les proxy d’entreprise\n• Pourquoi Websocket seul est trop bas niveau et comment STOMP comble ce manque\n• La scalabilité et les performances\n• Build mixte Java et Dart grâce à Gradle",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Java 8 Lambdas and Devices",
    "date": "2014-04-09T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/170169002/",
    "description": "Java 8 is the most impactful update to the Java ecosystem since Java 5, introducing an entirely new programming model with lambda expressions, and a whole new platform of applications with support for ARM embedded devices. In this presentation, you will learn how to take advantage of the new lambda-enabled Java 8 APIs including enhanced collections, functional interfaces, and simplified event handlers. Also, you will see live demonstrations of Java 8 technology running on embedded platforms such as Raspberry Pi and Lego Mindstorms EV3, allowing Java-based applications to support the internet-of-things. Come and learn how to build the future of Java.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Groovy vs Java 8",
    "date": "2014-04-03T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/173192882/",
    "description": "Java 8 n'a rien inventé! Depuis longtemps déjà Groovy permet d'utiliser les lambdas expressions, autorise le typage dynamique, facilite les opérations sur les collections de type map/reduce ainsi que beaucoup d'autres fonctionnalités qui simplifient la vie du développeur tout en rendant le code beaucoup plus lisible.\nVincent nous présentera les bases du langage Groovy, en quoi il peut être toujours intéressant avec l'arrivée de Java 8 ainsi que les différents outils et frameworks qui l'utilisent tels que Gradle, Grails ou Spock qui peuvent s'avérer trés utiles au quotidien.\nC'est l'occasion de découvrir un des langages majeurs de la JVM encore trop souvent méconnu.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Wikidata Workshop",
    "date": "2014-03-22T14:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/168636382/",
    "description": "Atelier Wikidata (par Nicolas Vigneron et Marin)\nLieu: salle D7 à l'étage.\nObjectif: faire découvrir Wikidata, son API, et les bases de consultations/contribution par du code.\nDans la première partie Nicolas nous présentera Wikidata et des outils déjà existants comme WikiDataQuery, l'API. L'objectif est de faire découvrir et comprendre l'esprit et le fonctionnement du projet. Cette présentation sera aussi l'occasion d'acquérir des compétences techniques et pratiques sur l'utilisation et la réutilisation de données Wikidata.\nDans la seconde partie, Marin abordera l'utilisation des données de Wikidata en PHP. Dresseur de robot, Il nous montrera comment utiliser Python et la bibliothèque pywikibot pour en développer.\nFormat\n•  environ 3 heures (le samedi après-midi) ;\n• présentation speaker (~5min) ;\n• présentation du projet WikiData (~15min) ;\n• introduction à l'API (~20-30min) ;\n• pratique en Python (~2h) ;\nPré-requis\nPour la partie pratique nous aurons besoin des outils suivants :\n• Python =2.7 ;\n• Pywikibot ;\n• un compte Wikipédia.\nNicolas Vigneron\nContributeur depuis 10 ans à Wikipédia et à des nombreux autres projets Wikimedia, il a naturellement adopté WikiData qui a un rôle de centralisation des projets Wikimedia. Il travaille notamment à l'organisation et la structuration des données dans Wikidata. \nMarin\nWikipédien depuis maintenant quatre ans, il contribue dans des domaines très variées, avec un goût pour le technique ce qui l'a amené à créer un robot actif sur Wikipédia et Wikidata ; au niveau local il est membre de la Cubale, groupement de Wikimédiens sur l'agglomération Bordelaise.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Live coding: Web temps réel avec Play 2",
    "date": "2014-03-13T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/170163822/",
    "description": "Les applications web temps réel font usage de WebSockets, Server Sent Events, Comet et d'autres protocoles pour offrir une communication permanente entre le serveur et le navigateur. De nombreux frameworks web offrent ce genre de possibilité à travers des APIs très basiques.\nCette présentation vous montrera comment utiliser l'API des Iteratees offerte par Play 2 pour manipuler, filtrer et fusionner à la demande des flux de données de manière réactive dans une application fun, complète et concrète.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Dart Flight school",
    "date": "2014-02-15T12:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/164822362/",
    "description": "Google a annoncé la version 1.0 de Dart en cette fin 2013 et lance une série d'événements pendant tout le mois de février : Dart Flight School (https://www.dartlang.org/events/2014/flight-school/).\nLe BordeauxJUG a répondu présent. Vincent Van Steenberghen et Laurent Forêt animeront à cette occasion un code lab d'environ 3 heures le samedi 15 février après midi à l'ENSEIRB.\nAttention !!! Les places sont limitées à la contenance d'une salle de TD (20 personnes).\nAlors, inscrivez-vous vite sur l'évènement eventbrite : http://www.eventbrite.fr/e/billets-atelier-dart-10280147197 \nSi vous le souhaitez, dans une ambiance conviviale, nous vous proposons de déjeuner ensemble au Central à côté de l'ENSEIRB. \nLes inscriptions se font ici : https://www.eventbrite.fr/e/billets-dartflight-bordeaux-noon-happyhours-10493872455\nLe programme sera le suivant :\nVidéo d'Introduction de 10 minutes Lars BakPrésentation du langage Dart en quelques slides.Un labo d'introduction à DartUn labo sur AngularDart.À la fin de cette session, vous aurez effectué un bon tour d'horizon du langage Dart et de son environnement.\nATTENTION : cela ne sert à rien de s'inscrire sur le meetup, seules les inscriptions eventbrite seront comptabilisées.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "JavaEE : Apache TomEE",
    "date": "2014-02-13T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/164013362/",
    "description": "Jeudi 13 Février à 19h00, Jean-Louis MONTEIRO viendra nous présenter TomEE, le serveur JavaEE d'Apache, cousin du célèbre Tomcat.\nJean-Louis est Architecte Logiciel senior, spécialisé en Java / Java EE et passionné par l’Open Source.Il participe au JCP d’Oracle pour la première fois en 2011 avec la spécification EJB 3.2. Il contribue largement à différents projets Open Source principalement au sein de la fondation Apache. Il est committer et PMC du projet Apache OpenEJB/TomEE.\nApache TomEE est un serveur certifié Java EE 6 Web Profile. Il est né en 2011 pour combiner la simplicité de Tomcat avec la puissance de Java EE.\nCette session présentera TomEE, son histoire et les raisons qui ont poussées la communauté à créer ce projet. Cela permettra de comprendre pourquoi développer des applications avec Java EE est aujourd'hui simple et efficace.Nous aborderons ensuite de manière avancée ce qui fait de TomEE, pas simplement un nouveau choix dans les serveurs d'applications, mais simplement le serveur d'application qu'attendaient les utilisateurs de Java EE.\nSi vous aimez Tomcat, cette session est faite pour vous !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Java 8 : lambdas, Streams et Collectors, le nouveau visage de l’API Collection",
    "date": "2014-01-16T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/158426962/",
    "description": "Pour attaquer l'année 2014 en beauté, Jeudi 16 Janvier à 19h00, José PAUMARD viendra nous présenter les nouveautés de l'API Collection avec Java 8.\nJosé est professeur, membre du Paris JUG et rompu aux plus grosses conférences. Son talk sur le sujet à Devoxx 2013 a été parmi les mieux notés par l’assistance.\nSi vous avez envie de découvrir ce qui nous attend sur le front de Java 8 et des nouveaux patterns de l’API Collection, ne loupez pas l’occasion!\nLa première partie de cette présentation introduit les lambda expressions, comment les écrire, et ce qu'elle nous apportent en tant que développeurs. \nLa deuxième partie présente en détail les nouveaux patterns introduits par les API Stream et Collector. \nCes nouvelles API vont changer la façon dont nous allons pouvoir traiter les collections de grande taille, y compris en parallèle, avec un modèle de programmation très simple, et des patterns très puissants. \nCette puissance sera montrée dans des exemples réels, qui monteront comment Java 8 va pouvoir nous aider à écrire simplement du code efficace et performant.\nInscrivez-vous vite!",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "AG 2013 du BordeauxJUG",
    "date": "2013-12-16T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/149668812/",
    "description": "Lundi 16 Décembre à 19h00 à l'ENSEIRB MATMECA , se tiendra l'Assemblée Générale ordinaire du Bordeaux JUG.\nCe sera l'occasion pour l'équipe de faire une rétrospective sur l'année passée ainsi que d'élire un nouveau bureau, tout cela autours d'un bon buffet (évidemment !).\nNous rappelons que l'AG est ouverte à tous. Par contre, seules les personnes ayant fait un don ou ayant souscrit au BordeauxJUG pourront prendre part au vote.\nN'hésitez donc pas à verser votre obole sur http://bordeauxjug.org/asso avant l'AG pour pouvoir voter !\nLes personnes souhaitant présenter leur candidature pour une nomination au Bureau sont les bienvenues et pourront le faire dans le cadre de l'AG.\nL'AG se conclura par un buffet aux alentours de 20h15.\nEn espérant vous voir nombreux.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Lambdas, from the great closure war to Java 8, an unexpected journey",
    "date": "2013-12-11T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/153792532/",
    "description": "Mercredi 11 Décembre à 19h00 dans l'amphi A de l'ENSEIRB MATMECA, Rémi FORAX nous présentera les lambdas introduites dans Java 8 et leur impact sur le code.\nLe talk est en deux parties,- pourquoi les lambdas sont ce qu'elles sont ?- pourquoi Java ne sera plus jamais le même ?\nPour bien comprendre les lambdas Rémi décrira leur historique afin d'expliquer le cheminement sinueux qui a été suivi pour arriver à la syntaxe et la sémantique actuelle. Puis il montrera quelques exemples d'utilisation des lambdas et la façon dont elles impactent le design d'APIs.\nAlors n'attendez pas, inscrivez vous vite !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Jeudi 14 Nov: What's The Fold",
    "date": "2013-11-14T19:00:00+01:00",
    "url": "https://www.meetup.com/bordeauxjug/events/148668382/",
    "description": "Les concepts de la programmation fonctionnelle illustrés avec Java 8, par Yannick Chartois\nCe light talk est basé sur le talk de Bodil Stokke: What Every Hipster Should Know About Functional Programming. C'est un petit exercice basé sur la question suivante: peut-on transposer tous les exemples JS de son talk en Java 8 avec des lambdas?\nWhat's The Fold, par Olivier Croisier\nVenez découvrir le concept de Fold !Hérité de la programmation fonctionnelle, le Fold abstrait l'itération sur vos structures de données, et améliore l'expressivité de votre code.Avec de vrais bouts de Java 8 et une pincée de Haskell !",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  },
  {
    "title": "Jeudi 17 Oct: Les lambdas arrivent, mais avez-vous bien compris les Generics ?",
    "date": "2013-10-17T19:00:00+02:00",
    "url": "https://www.meetup.com/bordeauxjug/events/143511422/",
    "description": "Les lambda expressions en Java arrivent à grands pas.Les génériques sont eux apparus en 2004.Joshua Bloch en a conclut: \"Chaque langage a un quota de complexité. Les génériques ont fait exploser celui de Java.\"\nEt pourtant, les lambda, aussi sexy soient-ils, vont venir ajouter à la complexité. Mélanger aux génériques, il s'agit d'un cocktail explosif.\nCette session remet les compteurs à zéro. Elle vous donne les clés pour maîtriser les génériques, mais aussi leurs liens avec les lambda. Tout pour aborder ces derniers sereinement.",
    "community": "bordeauxjug",
    "is_online": false,
    "venue": {
      "name": "ENSEIRB",
      "address": "1 Avenue du Docteur Albert Schweitzer",
      "city": "Talence",
      "country": "France"
    },
    "location": "1 Avenue du Docteur Albert Schweitzer, Talence"
  }
]